{"arxiv_id": "2307.13116v1", "published": "2023-07-12T08:27:37Z", "title": "Pathway: a fast and flexible unified stream data processing framework\n  for analytical and Machine Learning applications", "summary": "We present Pathway, a new unified data processing framework that can run\nworkloads on both bounded and unbounded data streams. The framework was created\nwith the original motivation of resolving challenges faced when analyzing and\nprocessing data from the physical economy, including streams of data generated\nby IoT and enterprise systems. These required rapid reaction while calling for\nthe application of advanced computation paradigms (machinelearning-powered\nanalytics, contextual analysis, and other elements of complex event\nprocessing). Pathway is equipped with a Table API tailored for Python and\nPython/SQL workflows, and is powered by a distributed incremental dataflow in\nRust. We describe the system and present benchmarking results which demonstrate\nits capabilities in both batch and streaming contexts, where it is able to\nsurpass state-of-the-art industry frameworks in both scenarios. We also discuss\nstreaming use cases handled by Pathway which cannot be easily resolved with\nstate-of-the-art industry frameworks, such as streaming iterative graph\nalgorithms (PageRank, etc.)."}
{"arxiv_id": "2301.05827v1", "published": "2023-01-14T06:17:37Z", "title": "Temperature dependence of (111) and (110) ceria surface energy", "summary": "High temperature properties of ceria surfaces are important for many\napplications. Here we report the temperature dependences of surface energy for\nthe (111) and (110) CeO2 obtained in the framework of the extended two-stage\nupsampled thermodynamic integration using Langevin dynamics (TU-TILD). The\nmethod was used together with machinelearning potentials called moment tensor\npotentials (MTPs), which were fitted to the results of the ab initio MD\ncalculations for (111) and (110) CeO2 at different temperatures. The parameters\nof MTPs training and fitting were tested and the optimal algorithm for the\nceria systems was proposed. We found that the temperature increases from 0 K to\n2100 K led to the decrease of the Helmholtz free energy of (111) CeO2 from 0.78\nJ/m2 to 0.64 J/m2. The energy of (110) CeO2 dropped from 1.19 J/m2 at 0 K to\n0.92 J/m2 at 1800 K. We show that it is important to take anharmonicity into\naccount as simple consideration of volume expansion gives wrong temperature\ndependences of the surface energies."}
{"arxiv_id": "2307.13116v1", "published": "2023-07-12T08:27:37Z", "title": "Pathway: a fast and flexible unified stream data processing framework\n  for analytical and Machine Learning applications", "summary": "We present Pathway, a new unified data processing framework that can run\nworkloads on both bounded and unbounded data streams. The framework was created\nwith the original motivation of resolving challenges faced when analyzing and\nprocessing data from the physical economy, including streams of data generated\nby IoT and enterprise systems. These required rapid reaction while calling for\nthe application of advanced computation paradigms (machinelearning-powered\nanalytics, contextual analysis, and other elements of complex event\nprocessing). Pathway is equipped with a Table API tailored for Python and\nPython/SQL workflows, and is powered by a distributed incremental dataflow in\nRust. We describe the system and present benchmarking results which demonstrate\nits capabilities in both batch and streaming contexts, where it is able to\nsurpass state-of-the-art industry frameworks in both scenarios. We also discuss\nstreaming use cases handled by Pathway which cannot be easily resolved with\nstate-of-the-art industry frameworks, such as streaming iterative graph\nalgorithms (PageRank, etc.)."}
{"arxiv_id": "2301.05827v1", "published": "2023-01-14T06:17:37Z", "title": "Temperature dependence of (111) and (110) ceria surface energy", "summary": "High temperature properties of ceria surfaces are important for many\napplications. Here we report the temperature dependences of surface energy for\nthe (111) and (110) CeO2 obtained in the framework of the extended two-stage\nupsampled thermodynamic integration using Langevin dynamics (TU-TILD). The\nmethod was used together with machinelearning potentials called moment tensor\npotentials (MTPs), which were fitted to the results of the ab initio MD\ncalculations for (111) and (110) CeO2 at different temperatures. The parameters\nof MTPs training and fitting were tested and the optimal algorithm for the\nceria systems was proposed. We found that the temperature increases from 0 K to\n2100 K led to the decrease of the Helmholtz free energy of (111) CeO2 from 0.78\nJ/m2 to 0.64 J/m2. The energy of (110) CeO2 dropped from 1.19 J/m2 at 0 K to\n0.92 J/m2 at 1800 K. We show that it is important to take anharmonicity into\naccount as simple consideration of volume expansion gives wrong temperature\ndependences of the surface energies."}
{"arxiv_id": "2307.13116v1", "published": "2023-07-12T08:27:37Z", "title": "Pathway: a fast and flexible unified stream data processing framework\n  for analytical and Machine Learning applications", "summary": "We present Pathway, a new unified data processing framework that can run\nworkloads on both bounded and unbounded data streams. The framework was created\nwith the original motivation of resolving challenges faced when analyzing and\nprocessing data from the physical economy, including streams of data generated\nby IoT and enterprise systems. These required rapid reaction while calling for\nthe application of advanced computation paradigms (machinelearning-powered\nanalytics, contextual analysis, and other elements of complex event\nprocessing). Pathway is equipped with a Table API tailored for Python and\nPython/SQL workflows, and is powered by a distributed incremental dataflow in\nRust. We describe the system and present benchmarking results which demonstrate\nits capabilities in both batch and streaming contexts, where it is able to\nsurpass state-of-the-art industry frameworks in both scenarios. We also discuss\nstreaming use cases handled by Pathway which cannot be easily resolved with\nstate-of-the-art industry frameworks, such as streaming iterative graph\nalgorithms (PageRank, etc.)."}
{"arxiv_id": "2301.05827v1", "published": "2023-01-14T06:17:37Z", "title": "Temperature dependence of (111) and (110) ceria surface energy", "summary": "High temperature properties of ceria surfaces are important for many\napplications. Here we report the temperature dependences of surface energy for\nthe (111) and (110) CeO2 obtained in the framework of the extended two-stage\nupsampled thermodynamic integration using Langevin dynamics (TU-TILD). The\nmethod was used together with machinelearning potentials called moment tensor\npotentials (MTPs), which were fitted to the results of the ab initio MD\ncalculations for (111) and (110) CeO2 at different temperatures. The parameters\nof MTPs training and fitting were tested and the optimal algorithm for the\nceria systems was proposed. We found that the temperature increases from 0 K to\n2100 K led to the decrease of the Helmholtz free energy of (111) CeO2 from 0.78\nJ/m2 to 0.64 J/m2. The energy of (110) CeO2 dropped from 1.19 J/m2 at 0 K to\n0.92 J/m2 at 1800 K. We show that it is important to take anharmonicity into\naccount as simple consideration of volume expansion gives wrong temperature\ndependences of the surface energies."}
{"arxiv_id": "2307.13116v1", "published": "2023-07-12T08:27:37Z", "title": "Pathway: a fast and flexible unified stream data processing framework\n  for analytical and Machine Learning applications", "summary": "We present Pathway, a new unified data processing framework that can run\nworkloads on both bounded and unbounded data streams. The framework was created\nwith the original motivation of resolving challenges faced when analyzing and\nprocessing data from the physical economy, including streams of data generated\nby IoT and enterprise systems. These required rapid reaction while calling for\nthe application of advanced computation paradigms (machinelearning-powered\nanalytics, contextual analysis, and other elements of complex event\nprocessing). Pathway is equipped with a Table API tailored for Python and\nPython/SQL workflows, and is powered by a distributed incremental dataflow in\nRust. We describe the system and present benchmarking results which demonstrate\nits capabilities in both batch and streaming contexts, where it is able to\nsurpass state-of-the-art industry frameworks in both scenarios. We also discuss\nstreaming use cases handled by Pathway which cannot be easily resolved with\nstate-of-the-art industry frameworks, such as streaming iterative graph\nalgorithms (PageRank, etc.)."}
{"arxiv_id": "2301.05827v1", "published": "2023-01-14T06:17:37Z", "title": "Temperature dependence of (111) and (110) ceria surface energy", "summary": "High temperature properties of ceria surfaces are important for many\napplications. Here we report the temperature dependences of surface energy for\nthe (111) and (110) CeO2 obtained in the framework of the extended two-stage\nupsampled thermodynamic integration using Langevin dynamics (TU-TILD). The\nmethod was used together with machinelearning potentials called moment tensor\npotentials (MTPs), which were fitted to the results of the ab initio MD\ncalculations for (111) and (110) CeO2 at different temperatures. The parameters\nof MTPs training and fitting were tested and the optimal algorithm for the\nceria systems was proposed. We found that the temperature increases from 0 K to\n2100 K led to the decrease of the Helmholtz free energy of (111) CeO2 from 0.78\nJ/m2 to 0.64 J/m2. The energy of (110) CeO2 dropped from 1.19 J/m2 at 0 K to\n0.92 J/m2 at 1800 K. We show that it is important to take anharmonicity into\naccount as simple consideration of volume expansion gives wrong temperature\ndependences of the surface energies."}
{"arxiv_id": "2402.07785v2", "published": "2024-02-12T16:50:07Z", "title": "HYPO: Hyperspherical Out-of-Distribution Generalization", "summary": "Out-of-distribution (OOD) generalization is critical for machine learning\nmodels deployed in the real world. However, achieving this can be fundamentally\nchallenging, as it requires the ability to learn invariant features across\ndifferent domains or environments. In this paper, we propose a novel framework\nHYPO (HYPerspherical OOD generalization) that provably learns domain-invariant\nrepresentations in a hyperspherical space. In particular, our hyperspherical\nlearning algorithm is guided by intra-class variation and inter-class\nseparation principles -- ensuring that features from the same class (across\ndifferent training domains) are closely aligned with their class prototypes,\nwhile different class prototypes are maximally separated. We further provide\ntheoretical justifications on how our prototypical learning objective improves\nthe OOD generalization bound. Through extensive experiments on challenging OOD\nbenchmarks, we demonstrate that our approach outperforms competitive baselines\nand achieves superior performance. Code is available at\nhttps://github.com/deeplearning-wisc/hypo."}
{"arxiv_id": "2402.03502v1", "published": "2024-02-05T20:36:33Z", "title": "How Does Unlabeled Data Provably Help Out-of-Distribution Detection?", "summary": "Using unlabeled data to regularize the machine learning models has\ndemonstrated promise for improving safety and reliability in detecting\nout-of-distribution (OOD) data. Harnessing the power of unlabeled in-the-wild\ndata is non-trivial due to the heterogeneity of both in-distribution (ID) and\nOOD data. This lack of a clean set of OOD samples poses significant challenges\nin learning an optimal OOD classifier. Currently, there is a lack of research\non formally understanding how unlabeled data helps OOD detection. This paper\nbridges the gap by introducing a new learning framework SAL (Separate And\nLearn) that offers both strong theoretical guarantees and empirical\neffectiveness. The framework separates candidate outliers from the unlabeled\ndata and then trains an OOD classifier using the candidate outliers and the\nlabeled ID data. Theoretically, we provide rigorous error bounds from the lens\nof separability and learnability, formally justifying the two components in our\nalgorithm. Our theory shows that SAL can separate the candidate outliers with\nsmall error rates, which leads to a generalization guarantee for the learned\nOOD classifier. Empirically, SAL achieves state-of-the-art performance on\ncommon benchmarks, reinforcing our theoretical insights. Code is publicly\navailable at https://github.com/deeplearning-wisc/sal."}
{"arxiv_id": "2402.03386v1", "published": "2024-02-04T09:22:52Z", "title": "A generalized decision tree ensemble based on the NeuralNetworks\n  architecture: Distributed Gradient Boosting Forest (DGBF)", "summary": "Tree ensemble algorithms as RandomForest and GradientBoosting are currently\nthe dominant methods for modeling discrete or tabular data, however, they are\nunable to perform a hierarchical representation learning from raw data as\nNeuralNetworks does thanks to its multi-layered structure, which is a key\nfeature for DeepLearning problems and modeling unstructured data. This\nlimitation is due to the fact that tree algorithms can not be trained with\nback-propagation because of their mathematical nature. However, in this work,\nwe demonstrate that the mathematical formulation of bagging and boosting can be\ncombined together to define a graph-structured-tree-ensemble algorithm with a\ndistributed representation learning process between trees naturally (without\nusing back-propagation). We call this novel approach Distributed Gradient\nBoosting Forest (DGBF) and we demonstrate that both RandomForest and\nGradientBoosting can be expressed as particular graph architectures of DGBT.\nFinally, we see that the distributed learning outperforms both RandomForest and\nGradientBoosting in 7 out of 9 datasets."}
{"arxiv_id": "2401.14206v1", "published": "2024-01-25T14:40:58Z", "title": "Exploiting Liver CT scans in Colorectal Carcinoma genomics mutation\n  classification", "summary": "The liver is the most involved organ by distant metastasis in colon-rectal\ncancer (CRC) patients and it comes necessary to be aware of the mutational\nstatus of the lesions to correctly design the best individual treatment. So\nfar, efforts have been made in order to develop non-invasive and real-time\nmethods that permit the analysis of the whole tumor, using new artificial\nintelligence tools to analyze the tumor's image obtained by Computed Tomography\n(CT) scan. In order to address the current medical workflow, that is biopsy\nanalysis-based, we propose the first DeepLearning-based exploration, to our\nknowledge, of such classification approach from the patient medical imaging. We\npropose i) a solid pipeline for managing undersized datasets of available CT\nscans and ii) a baseline study for genomics mutation diagnosis support for\npreemptive patient follow-up. Our method is able to identify CRC RAS mutation\nfamily from CT images with 0.73 F1 score."}
{"arxiv_id": "2402.01694v1", "published": "2024-01-23T23:42:41Z", "title": "ARGS: Alignment as Reward-Guided Search", "summary": "Aligning large language models with human objectives is paramount, yet common\napproaches including RLHF suffer from unstable and resource-intensive training.\nIn response to this challenge, we introduce ARGS, Alignment as Reward-Guided\nSearch, a novel framework that integrates alignment into the decoding process,\neliminating the need for expensive RL training. By adjusting the model's\nprobabilistic predictions using a reward signal, ARGS generates texts with\nsemantic diversity while being aligned with human preferences, offering a\npromising and flexible solution for aligning language models. Notably, ARGS\ndemonstrates consistent enhancements in average reward compared to baselines\nacross diverse alignment tasks and various model dimensions. For example, under\nthe same greedy-based decoding strategy, our method improves the average reward\nby 19.56% relative to the baseline and secures a preference or tie score of\n64.33% in GPT-4 evaluation. We believe that our framework, emphasizing\ndecoding-time alignment, paves the way for more responsive language models in\nthe future. Code is publicly available at:\n\\url{https://github.com/deeplearning-wisc/args}."}
{"arxiv_id": "2309.13415v1", "published": "2023-09-23T15:58:27Z", "title": "Dream the Impossible: Outlier Imagination with Diffusion Models", "summary": "Utilizing auxiliary outlier datasets to regularize the machine learning model\nhas demonstrated promise for out-of-distribution (OOD) detection and safe\nprediction. Due to the labor intensity in data collection and cleaning,\nautomating outlier data generation has been a long-desired alternative. Despite\nthe appeal, generating photo-realistic outliers in the high dimensional pixel\nspace has been an open challenge for the field. To tackle the problem, this\npaper proposes a new framework DREAM-OOD, which enables imagining\nphoto-realistic outliers by way of diffusion models, provided with only the\nin-distribution (ID) data and classes. Specifically, DREAM-OOD learns a\ntext-conditioned latent space based on ID data, and then samples outliers in\nthe low-likelihood region via the latent, which can be decoded into images by\nthe diffusion model. Different from prior works, DREAM-OOD enables visualizing\nand understanding the imagined outliers, directly in the pixel space. We\nconduct comprehensive quantitative and qualitative studies to understand the\nefficacy of DREAM-OOD, and show that training with the samples generated by\nDREAM-OOD can benefit OOD detection performance. Code is publicly available at\nhttps://github.com/deeplearning-wisc/dream-ood."}
{"arxiv_id": "2307.05623v1", "published": "2023-07-11T04:58:45Z", "title": "A DeepLearning Framework for Dynamic Estimation of Origin-Destination\n  Sequence", "summary": "OD matrix estimation is a critical problem in the transportation domain. The\nprinciple method uses the traffic sensor measured information such as traffic\ncounts to estimate the traffic demand represented by the OD matrix. The problem\nis divided into two categories: static OD matrix estimation and dynamic OD\nmatrices sequence(OD sequence for short) estimation. The above two face the\nunderdetermination problem caused by abundant estimated parameters and\ninsufficient constraint information. In addition, OD sequence estimation also\nfaces the lag challenge: due to different traffic conditions such as\ncongestion, identical vehicle will appear on different road sections during the\nsame observation period, resulting in identical OD demands correspond to\ndifferent trips. To this end, this paper proposes an integrated method, which\nuses deep learning methods to infer the structure of OD sequence and uses\nstructural constraints to guide traditional numerical optimization. Our\nexperiments show that the neural network(NN) can effectively infer the\nstructure of the OD sequence and provide practical constraints for numerical\noptimization to obtain better results. Moreover, the experiments show that\nprovided structural information contains not only constraints on the spatial\nstructure of OD matrices but also provides constraints on the temporal\nstructure of OD sequence, which solve the effect of the lagging problem well."}
{"arxiv_id": "2306.09158v1", "published": "2023-06-15T14:32:35Z", "title": "Feed Two Birds with One Scone: Exploiting Wild Data for Both\n  Out-of-Distribution Generalization and Detection", "summary": "Modern machine learning models deployed in the wild can encounter both\ncovariate and semantic shifts, giving rise to the problems of\nout-of-distribution (OOD) generalization and OOD detection respectively. While\nboth problems have received significant research attention lately, they have\nbeen pursued independently. This may not be surprising, since the two tasks\nhave seemingly conflicting goals. This paper provides a new unified approach\nthat is capable of simultaneously generalizing to covariate shifts while\nrobustly detecting semantic shifts. We propose a margin-based learning\nframework that exploits freely available unlabeled data in the wild that\ncaptures the environmental test-time OOD distributions under both covariate and\nsemantic shifts. We show both empirically and theoretically that the proposed\nmargin constraint is the key to achieving both OOD generalization and\ndetection. Extensive experiments show the superiority of our framework,\noutperforming competitive baselines that specialize in either OOD\ngeneralization or OOD detection. Code is publicly available at\nhttps://github.com/deeplearning-wisc/scone."}
{"arxiv_id": "2306.01249v1", "published": "2023-06-02T03:23:16Z", "title": "Transforming ECG Diagnosis:An In-depth Review of Transformer-based\n  DeepLearning Models in Cardiovascular Disease Detection", "summary": "The emergence of deep learning has significantly enhanced the analysis of\nelectrocardiograms (ECGs), a non-invasive method that is essential for\nassessing heart health. Despite the complexity of ECG interpretation, advanced\ndeep learning models outperform traditional methods. However, the increasing\ncomplexity of ECG data and the need for real-time and accurate diagnosis\nnecessitate exploring more robust architectures, such as transformers. Here, we\npresent an in-depth review of transformer architectures that are applied to ECG\nclassification. Originally developed for natural language processing, these\nmodels capture complex temporal relationships in ECG signals that other models\nmight overlook. We conducted an extensive search of the latest\ntransformer-based models and summarize them to discuss the advances and\nchallenges in their application and suggest potential future improvements. This\nreview serves as a valuable resource for researchers and practitioners and aims\nto shed light on this innovative application in ECG interpretation."}
{"arxiv_id": "2305.08325v1", "published": "2023-05-15T03:24:36Z", "title": "Screentone-Aware Manga Super-Resolution Using DeepLearning", "summary": "Manga, as a widely beloved form of entertainment around the world, have\nshifted from paper to electronic screens with the proliferation of handheld\ndevices. However, as the demand for image quality increases with screen\ndevelopment, high-quality images can hinder transmission and affect the viewing\nexperience. Traditional vectorization methods require a significant amount of\nmanual parameter adjustment to process screentone. Using deep learning, lines\nand screentone can be automatically extracted and image resolution can be\nenhanced. Super-resolution can convert low-resolution images to high-resolution\nimages while maintaining low transmission rates and providing high-quality\nresults. However, traditional Super Resolution methods for improving manga\nresolution do not consider the meaning of screentone density, resulting in\nchanges to screentone density and loss of meaning. In this paper, we aims to\naddress this issue by first classifying the regions and lines of different\nscreentone in the manga using deep learning algorithm, then using corresponding\nsuper-resolution models for quality enhancement based on the different\nclassifications of each block, and finally combining them to obtain images that\nmaintain the meaning of screentone and lines in the manga while improving image\nresolution."}
{"arxiv_id": "2303.02966v1", "published": "2023-03-06T08:51:00Z", "title": "Non-Parametric Outlier Synthesis", "summary": "Out-of-distribution (OOD) detection is indispensable for safely deploying\nmachine learning models in the wild. One of the key challenges is that models\nlack supervision signals from unknown data, and as a result, can produce\noverconfident predictions on OOD data. Recent work on outlier synthesis modeled\nthe feature space as parametric Gaussian distribution, a strong and restrictive\nassumption that might not hold in reality. In this paper, we propose a novel\nframework, Non-Parametric Outlier Synthesis (NPOS), which generates artificial\nOOD training data and facilitates learning a reliable decision boundary between\nID and OOD data. Importantly, our proposed synthesis approach does not make any\ndistributional assumption on the ID embeddings, thereby offering strong\nflexibility and generality. We show that our synthesis approach can be\nmathematically interpreted as a rejection sampling framework. Extensive\nexperiments show that NPOS can achieve superior OOD detection performance,\noutperforming the competitive rivals by a significant margin. Code is publicly\navailable at https://github.com/deeplearning-wisc/npos."}
{"arxiv_id": "2402.07785v2", "published": "2024-02-12T16:50:07Z", "title": "HYPO: Hyperspherical Out-of-Distribution Generalization", "summary": "Out-of-distribution (OOD) generalization is critical for machine learning\nmodels deployed in the real world. However, achieving this can be fundamentally\nchallenging, as it requires the ability to learn invariant features across\ndifferent domains or environments. In this paper, we propose a novel framework\nHYPO (HYPerspherical OOD generalization) that provably learns domain-invariant\nrepresentations in a hyperspherical space. In particular, our hyperspherical\nlearning algorithm is guided by intra-class variation and inter-class\nseparation principles -- ensuring that features from the same class (across\ndifferent training domains) are closely aligned with their class prototypes,\nwhile different class prototypes are maximally separated. We further provide\ntheoretical justifications on how our prototypical learning objective improves\nthe OOD generalization bound. Through extensive experiments on challenging OOD\nbenchmarks, we demonstrate that our approach outperforms competitive baselines\nand achieves superior performance. Code is available at\nhttps://github.com/deeplearning-wisc/hypo."}
{"arxiv_id": "2402.03502v1", "published": "2024-02-05T20:36:33Z", "title": "How Does Unlabeled Data Provably Help Out-of-Distribution Detection?", "summary": "Using unlabeled data to regularize the machine learning models has\ndemonstrated promise for improving safety and reliability in detecting\nout-of-distribution (OOD) data. Harnessing the power of unlabeled in-the-wild\ndata is non-trivial due to the heterogeneity of both in-distribution (ID) and\nOOD data. This lack of a clean set of OOD samples poses significant challenges\nin learning an optimal OOD classifier. Currently, there is a lack of research\non formally understanding how unlabeled data helps OOD detection. This paper\nbridges the gap by introducing a new learning framework SAL (Separate And\nLearn) that offers both strong theoretical guarantees and empirical\neffectiveness. The framework separates candidate outliers from the unlabeled\ndata and then trains an OOD classifier using the candidate outliers and the\nlabeled ID data. Theoretically, we provide rigorous error bounds from the lens\nof separability and learnability, formally justifying the two components in our\nalgorithm. Our theory shows that SAL can separate the candidate outliers with\nsmall error rates, which leads to a generalization guarantee for the learned\nOOD classifier. Empirically, SAL achieves state-of-the-art performance on\ncommon benchmarks, reinforcing our theoretical insights. Code is publicly\navailable at https://github.com/deeplearning-wisc/sal."}
{"arxiv_id": "2402.03386v1", "published": "2024-02-04T09:22:52Z", "title": "A generalized decision tree ensemble based on the NeuralNetworks\n  architecture: Distributed Gradient Boosting Forest (DGBF)", "summary": "Tree ensemble algorithms as RandomForest and GradientBoosting are currently\nthe dominant methods for modeling discrete or tabular data, however, they are\nunable to perform a hierarchical representation learning from raw data as\nNeuralNetworks does thanks to its multi-layered structure, which is a key\nfeature for DeepLearning problems and modeling unstructured data. This\nlimitation is due to the fact that tree algorithms can not be trained with\nback-propagation because of their mathematical nature. However, in this work,\nwe demonstrate that the mathematical formulation of bagging and boosting can be\ncombined together to define a graph-structured-tree-ensemble algorithm with a\ndistributed representation learning process between trees naturally (without\nusing back-propagation). We call this novel approach Distributed Gradient\nBoosting Forest (DGBF) and we demonstrate that both RandomForest and\nGradientBoosting can be expressed as particular graph architectures of DGBT.\nFinally, we see that the distributed learning outperforms both RandomForest and\nGradientBoosting in 7 out of 9 datasets."}
{"arxiv_id": "2401.14206v1", "published": "2024-01-25T14:40:58Z", "title": "Exploiting Liver CT scans in Colorectal Carcinoma genomics mutation\n  classification", "summary": "The liver is the most involved organ by distant metastasis in colon-rectal\ncancer (CRC) patients and it comes necessary to be aware of the mutational\nstatus of the lesions to correctly design the best individual treatment. So\nfar, efforts have been made in order to develop non-invasive and real-time\nmethods that permit the analysis of the whole tumor, using new artificial\nintelligence tools to analyze the tumor's image obtained by Computed Tomography\n(CT) scan. In order to address the current medical workflow, that is biopsy\nanalysis-based, we propose the first DeepLearning-based exploration, to our\nknowledge, of such classification approach from the patient medical imaging. We\npropose i) a solid pipeline for managing undersized datasets of available CT\nscans and ii) a baseline study for genomics mutation diagnosis support for\npreemptive patient follow-up. Our method is able to identify CRC RAS mutation\nfamily from CT images with 0.73 F1 score."}
{"arxiv_id": "2402.01694v1", "published": "2024-01-23T23:42:41Z", "title": "ARGS: Alignment as Reward-Guided Search", "summary": "Aligning large language models with human objectives is paramount, yet common\napproaches including RLHF suffer from unstable and resource-intensive training.\nIn response to this challenge, we introduce ARGS, Alignment as Reward-Guided\nSearch, a novel framework that integrates alignment into the decoding process,\neliminating the need for expensive RL training. By adjusting the model's\nprobabilistic predictions using a reward signal, ARGS generates texts with\nsemantic diversity while being aligned with human preferences, offering a\npromising and flexible solution for aligning language models. Notably, ARGS\ndemonstrates consistent enhancements in average reward compared to baselines\nacross diverse alignment tasks and various model dimensions. For example, under\nthe same greedy-based decoding strategy, our method improves the average reward\nby 19.56% relative to the baseline and secures a preference or tie score of\n64.33% in GPT-4 evaluation. We believe that our framework, emphasizing\ndecoding-time alignment, paves the way for more responsive language models in\nthe future. Code is publicly available at:\n\\url{https://github.com/deeplearning-wisc/args}."}
{"arxiv_id": "2309.13415v1", "published": "2023-09-23T15:58:27Z", "title": "Dream the Impossible: Outlier Imagination with Diffusion Models", "summary": "Utilizing auxiliary outlier datasets to regularize the machine learning model\nhas demonstrated promise for out-of-distribution (OOD) detection and safe\nprediction. Due to the labor intensity in data collection and cleaning,\nautomating outlier data generation has been a long-desired alternative. Despite\nthe appeal, generating photo-realistic outliers in the high dimensional pixel\nspace has been an open challenge for the field. To tackle the problem, this\npaper proposes a new framework DREAM-OOD, which enables imagining\nphoto-realistic outliers by way of diffusion models, provided with only the\nin-distribution (ID) data and classes. Specifically, DREAM-OOD learns a\ntext-conditioned latent space based on ID data, and then samples outliers in\nthe low-likelihood region via the latent, which can be decoded into images by\nthe diffusion model. Different from prior works, DREAM-OOD enables visualizing\nand understanding the imagined outliers, directly in the pixel space. We\nconduct comprehensive quantitative and qualitative studies to understand the\nefficacy of DREAM-OOD, and show that training with the samples generated by\nDREAM-OOD can benefit OOD detection performance. Code is publicly available at\nhttps://github.com/deeplearning-wisc/dream-ood."}
{"arxiv_id": "2307.05623v1", "published": "2023-07-11T04:58:45Z", "title": "A DeepLearning Framework for Dynamic Estimation of Origin-Destination\n  Sequence", "summary": "OD matrix estimation is a critical problem in the transportation domain. The\nprinciple method uses the traffic sensor measured information such as traffic\ncounts to estimate the traffic demand represented by the OD matrix. The problem\nis divided into two categories: static OD matrix estimation and dynamic OD\nmatrices sequence(OD sequence for short) estimation. The above two face the\nunderdetermination problem caused by abundant estimated parameters and\ninsufficient constraint information. In addition, OD sequence estimation also\nfaces the lag challenge: due to different traffic conditions such as\ncongestion, identical vehicle will appear on different road sections during the\nsame observation period, resulting in identical OD demands correspond to\ndifferent trips. To this end, this paper proposes an integrated method, which\nuses deep learning methods to infer the structure of OD sequence and uses\nstructural constraints to guide traditional numerical optimization. Our\nexperiments show that the neural network(NN) can effectively infer the\nstructure of the OD sequence and provide practical constraints for numerical\noptimization to obtain better results. Moreover, the experiments show that\nprovided structural information contains not only constraints on the spatial\nstructure of OD matrices but also provides constraints on the temporal\nstructure of OD sequence, which solve the effect of the lagging problem well."}
{"arxiv_id": "2306.09158v1", "published": "2023-06-15T14:32:35Z", "title": "Feed Two Birds with One Scone: Exploiting Wild Data for Both\n  Out-of-Distribution Generalization and Detection", "summary": "Modern machine learning models deployed in the wild can encounter both\ncovariate and semantic shifts, giving rise to the problems of\nout-of-distribution (OOD) generalization and OOD detection respectively. While\nboth problems have received significant research attention lately, they have\nbeen pursued independently. This may not be surprising, since the two tasks\nhave seemingly conflicting goals. This paper provides a new unified approach\nthat is capable of simultaneously generalizing to covariate shifts while\nrobustly detecting semantic shifts. We propose a margin-based learning\nframework that exploits freely available unlabeled data in the wild that\ncaptures the environmental test-time OOD distributions under both covariate and\nsemantic shifts. We show both empirically and theoretically that the proposed\nmargin constraint is the key to achieving both OOD generalization and\ndetection. Extensive experiments show the superiority of our framework,\noutperforming competitive baselines that specialize in either OOD\ngeneralization or OOD detection. Code is publicly available at\nhttps://github.com/deeplearning-wisc/scone."}
{"arxiv_id": "2306.01249v1", "published": "2023-06-02T03:23:16Z", "title": "Transforming ECG Diagnosis:An In-depth Review of Transformer-based\n  DeepLearning Models in Cardiovascular Disease Detection", "summary": "The emergence of deep learning has significantly enhanced the analysis of\nelectrocardiograms (ECGs), a non-invasive method that is essential for\nassessing heart health. Despite the complexity of ECG interpretation, advanced\ndeep learning models outperform traditional methods. However, the increasing\ncomplexity of ECG data and the need for real-time and accurate diagnosis\nnecessitate exploring more robust architectures, such as transformers. Here, we\npresent an in-depth review of transformer architectures that are applied to ECG\nclassification. Originally developed for natural language processing, these\nmodels capture complex temporal relationships in ECG signals that other models\nmight overlook. We conducted an extensive search of the latest\ntransformer-based models and summarize them to discuss the advances and\nchallenges in their application and suggest potential future improvements. This\nreview serves as a valuable resource for researchers and practitioners and aims\nto shed light on this innovative application in ECG interpretation."}
{"arxiv_id": "2305.08325v1", "published": "2023-05-15T03:24:36Z", "title": "Screentone-Aware Manga Super-Resolution Using DeepLearning", "summary": "Manga, as a widely beloved form of entertainment around the world, have\nshifted from paper to electronic screens with the proliferation of handheld\ndevices. However, as the demand for image quality increases with screen\ndevelopment, high-quality images can hinder transmission and affect the viewing\nexperience. Traditional vectorization methods require a significant amount of\nmanual parameter adjustment to process screentone. Using deep learning, lines\nand screentone can be automatically extracted and image resolution can be\nenhanced. Super-resolution can convert low-resolution images to high-resolution\nimages while maintaining low transmission rates and providing high-quality\nresults. However, traditional Super Resolution methods for improving manga\nresolution do not consider the meaning of screentone density, resulting in\nchanges to screentone density and loss of meaning. In this paper, we aims to\naddress this issue by first classifying the regions and lines of different\nscreentone in the manga using deep learning algorithm, then using corresponding\nsuper-resolution models for quality enhancement based on the different\nclassifications of each block, and finally combining them to obtain images that\nmaintain the meaning of screentone and lines in the manga while improving image\nresolution."}
{"arxiv_id": "2402.07785v2", "published": "2024-02-12T16:50:07Z", "title": "HYPO: Hyperspherical Out-of-Distribution Generalization", "summary": "Out-of-distribution (OOD) generalization is critical for machine learning\nmodels deployed in the real world. However, achieving this can be fundamentally\nchallenging, as it requires the ability to learn invariant features across\ndifferent domains or environments. In this paper, we propose a novel framework\nHYPO (HYPerspherical OOD generalization) that provably learns domain-invariant\nrepresentations in a hyperspherical space. In particular, our hyperspherical\nlearning algorithm is guided by intra-class variation and inter-class\nseparation principles -- ensuring that features from the same class (across\ndifferent training domains) are closely aligned with their class prototypes,\nwhile different class prototypes are maximally separated. We further provide\ntheoretical justifications on how our prototypical learning objective improves\nthe OOD generalization bound. Through extensive experiments on challenging OOD\nbenchmarks, we demonstrate that our approach outperforms competitive baselines\nand achieves superior performance. Code is available at\nhttps://github.com/deeplearning-wisc/hypo."}
{"arxiv_id": "2402.03502v1", "published": "2024-02-05T20:36:33Z", "title": "How Does Unlabeled Data Provably Help Out-of-Distribution Detection?", "summary": "Using unlabeled data to regularize the machine learning models has\ndemonstrated promise for improving safety and reliability in detecting\nout-of-distribution (OOD) data. Harnessing the power of unlabeled in-the-wild\ndata is non-trivial due to the heterogeneity of both in-distribution (ID) and\nOOD data. This lack of a clean set of OOD samples poses significant challenges\nin learning an optimal OOD classifier. Currently, there is a lack of research\non formally understanding how unlabeled data helps OOD detection. This paper\nbridges the gap by introducing a new learning framework SAL (Separate And\nLearn) that offers both strong theoretical guarantees and empirical\neffectiveness. The framework separates candidate outliers from the unlabeled\ndata and then trains an OOD classifier using the candidate outliers and the\nlabeled ID data. Theoretically, we provide rigorous error bounds from the lens\nof separability and learnability, formally justifying the two components in our\nalgorithm. Our theory shows that SAL can separate the candidate outliers with\nsmall error rates, which leads to a generalization guarantee for the learned\nOOD classifier. Empirically, SAL achieves state-of-the-art performance on\ncommon benchmarks, reinforcing our theoretical insights. Code is publicly\navailable at https://github.com/deeplearning-wisc/sal."}
{"arxiv_id": "2402.03386v1", "published": "2024-02-04T09:22:52Z", "title": "A generalized decision tree ensemble based on the NeuralNetworks\n  architecture: Distributed Gradient Boosting Forest (DGBF)", "summary": "Tree ensemble algorithms as RandomForest and GradientBoosting are currently\nthe dominant methods for modeling discrete or tabular data, however, they are\nunable to perform a hierarchical representation learning from raw data as\nNeuralNetworks does thanks to its multi-layered structure, which is a key\nfeature for DeepLearning problems and modeling unstructured data. This\nlimitation is due to the fact that tree algorithms can not be trained with\nback-propagation because of their mathematical nature. However, in this work,\nwe demonstrate that the mathematical formulation of bagging and boosting can be\ncombined together to define a graph-structured-tree-ensemble algorithm with a\ndistributed representation learning process between trees naturally (without\nusing back-propagation). We call this novel approach Distributed Gradient\nBoosting Forest (DGBF) and we demonstrate that both RandomForest and\nGradientBoosting can be expressed as particular graph architectures of DGBT.\nFinally, we see that the distributed learning outperforms both RandomForest and\nGradientBoosting in 7 out of 9 datasets."}
{"arxiv_id": "2401.14206v1", "published": "2024-01-25T14:40:58Z", "title": "Exploiting Liver CT scans in Colorectal Carcinoma genomics mutation\n  classification", "summary": "The liver is the most involved organ by distant metastasis in colon-rectal\ncancer (CRC) patients and it comes necessary to be aware of the mutational\nstatus of the lesions to correctly design the best individual treatment. So\nfar, efforts have been made in order to develop non-invasive and real-time\nmethods that permit the analysis of the whole tumor, using new artificial\nintelligence tools to analyze the tumor's image obtained by Computed Tomography\n(CT) scan. In order to address the current medical workflow, that is biopsy\nanalysis-based, we propose the first DeepLearning-based exploration, to our\nknowledge, of such classification approach from the patient medical imaging. We\npropose i) a solid pipeline for managing undersized datasets of available CT\nscans and ii) a baseline study for genomics mutation diagnosis support for\npreemptive patient follow-up. Our method is able to identify CRC RAS mutation\nfamily from CT images with 0.73 F1 score."}
{"arxiv_id": "2402.01694v1", "published": "2024-01-23T23:42:41Z", "title": "ARGS: Alignment as Reward-Guided Search", "summary": "Aligning large language models with human objectives is paramount, yet common\napproaches including RLHF suffer from unstable and resource-intensive training.\nIn response to this challenge, we introduce ARGS, Alignment as Reward-Guided\nSearch, a novel framework that integrates alignment into the decoding process,\neliminating the need for expensive RL training. By adjusting the model's\nprobabilistic predictions using a reward signal, ARGS generates texts with\nsemantic diversity while being aligned with human preferences, offering a\npromising and flexible solution for aligning language models. Notably, ARGS\ndemonstrates consistent enhancements in average reward compared to baselines\nacross diverse alignment tasks and various model dimensions. For example, under\nthe same greedy-based decoding strategy, our method improves the average reward\nby 19.56% relative to the baseline and secures a preference or tie score of\n64.33% in GPT-4 evaluation. We believe that our framework, emphasizing\ndecoding-time alignment, paves the way for more responsive language models in\nthe future. Code is publicly available at:\n\\url{https://github.com/deeplearning-wisc/args}."}
{"arxiv_id": "2309.13415v1", "published": "2023-09-23T15:58:27Z", "title": "Dream the Impossible: Outlier Imagination with Diffusion Models", "summary": "Utilizing auxiliary outlier datasets to regularize the machine learning model\nhas demonstrated promise for out-of-distribution (OOD) detection and safe\nprediction. Due to the labor intensity in data collection and cleaning,\nautomating outlier data generation has been a long-desired alternative. Despite\nthe appeal, generating photo-realistic outliers in the high dimensional pixel\nspace has been an open challenge for the field. To tackle the problem, this\npaper proposes a new framework DREAM-OOD, which enables imagining\nphoto-realistic outliers by way of diffusion models, provided with only the\nin-distribution (ID) data and classes. Specifically, DREAM-OOD learns a\ntext-conditioned latent space based on ID data, and then samples outliers in\nthe low-likelihood region via the latent, which can be decoded into images by\nthe diffusion model. Different from prior works, DREAM-OOD enables visualizing\nand understanding the imagined outliers, directly in the pixel space. We\nconduct comprehensive quantitative and qualitative studies to understand the\nefficacy of DREAM-OOD, and show that training with the samples generated by\nDREAM-OOD can benefit OOD detection performance. Code is publicly available at\nhttps://github.com/deeplearning-wisc/dream-ood."}
{"arxiv_id": "2307.05623v1", "published": "2023-07-11T04:58:45Z", "title": "A DeepLearning Framework for Dynamic Estimation of Origin-Destination\n  Sequence", "summary": "OD matrix estimation is a critical problem in the transportation domain. The\nprinciple method uses the traffic sensor measured information such as traffic\ncounts to estimate the traffic demand represented by the OD matrix. The problem\nis divided into two categories: static OD matrix estimation and dynamic OD\nmatrices sequence(OD sequence for short) estimation. The above two face the\nunderdetermination problem caused by abundant estimated parameters and\ninsufficient constraint information. In addition, OD sequence estimation also\nfaces the lag challenge: due to different traffic conditions such as\ncongestion, identical vehicle will appear on different road sections during the\nsame observation period, resulting in identical OD demands correspond to\ndifferent trips. To this end, this paper proposes an integrated method, which\nuses deep learning methods to infer the structure of OD sequence and uses\nstructural constraints to guide traditional numerical optimization. Our\nexperiments show that the neural network(NN) can effectively infer the\nstructure of the OD sequence and provide practical constraints for numerical\noptimization to obtain better results. Moreover, the experiments show that\nprovided structural information contains not only constraints on the spatial\nstructure of OD matrices but also provides constraints on the temporal\nstructure of OD sequence, which solve the effect of the lagging problem well."}
{"arxiv_id": "2306.09158v1", "published": "2023-06-15T14:32:35Z", "title": "Feed Two Birds with One Scone: Exploiting Wild Data for Both\n  Out-of-Distribution Generalization and Detection", "summary": "Modern machine learning models deployed in the wild can encounter both\ncovariate and semantic shifts, giving rise to the problems of\nout-of-distribution (OOD) generalization and OOD detection respectively. While\nboth problems have received significant research attention lately, they have\nbeen pursued independently. This may not be surprising, since the two tasks\nhave seemingly conflicting goals. This paper provides a new unified approach\nthat is capable of simultaneously generalizing to covariate shifts while\nrobustly detecting semantic shifts. We propose a margin-based learning\nframework that exploits freely available unlabeled data in the wild that\ncaptures the environmental test-time OOD distributions under both covariate and\nsemantic shifts. We show both empirically and theoretically that the proposed\nmargin constraint is the key to achieving both OOD generalization and\ndetection. Extensive experiments show the superiority of our framework,\noutperforming competitive baselines that specialize in either OOD\ngeneralization or OOD detection. Code is publicly available at\nhttps://github.com/deeplearning-wisc/scone."}
{"arxiv_id": "2306.01249v1", "published": "2023-06-02T03:23:16Z", "title": "Transforming ECG Diagnosis:An In-depth Review of Transformer-based\n  DeepLearning Models in Cardiovascular Disease Detection", "summary": "The emergence of deep learning has significantly enhanced the analysis of\nelectrocardiograms (ECGs), a non-invasive method that is essential for\nassessing heart health. Despite the complexity of ECG interpretation, advanced\ndeep learning models outperform traditional methods. However, the increasing\ncomplexity of ECG data and the need for real-time and accurate diagnosis\nnecessitate exploring more robust architectures, such as transformers. Here, we\npresent an in-depth review of transformer architectures that are applied to ECG\nclassification. Originally developed for natural language processing, these\nmodels capture complex temporal relationships in ECG signals that other models\nmight overlook. We conducted an extensive search of the latest\ntransformer-based models and summarize them to discuss the advances and\nchallenges in their application and suggest potential future improvements. This\nreview serves as a valuable resource for researchers and practitioners and aims\nto shed light on this innovative application in ECG interpretation."}
{"arxiv_id": "2305.08325v1", "published": "2023-05-15T03:24:36Z", "title": "Screentone-Aware Manga Super-Resolution Using DeepLearning", "summary": "Manga, as a widely beloved form of entertainment around the world, have\nshifted from paper to electronic screens with the proliferation of handheld\ndevices. However, as the demand for image quality increases with screen\ndevelopment, high-quality images can hinder transmission and affect the viewing\nexperience. Traditional vectorization methods require a significant amount of\nmanual parameter adjustment to process screentone. Using deep learning, lines\nand screentone can be automatically extracted and image resolution can be\nenhanced. Super-resolution can convert low-resolution images to high-resolution\nimages while maintaining low transmission rates and providing high-quality\nresults. However, traditional Super Resolution methods for improving manga\nresolution do not consider the meaning of screentone density, resulting in\nchanges to screentone density and loss of meaning. In this paper, we aims to\naddress this issue by first classifying the regions and lines of different\nscreentone in the manga using deep learning algorithm, then using corresponding\nsuper-resolution models for quality enhancement based on the different\nclassifications of each block, and finally combining them to obtain images that\nmaintain the meaning of screentone and lines in the manga while improving image\nresolution."}
{"arxiv_id": "2307.13116v1", "published": "2023-07-12T08:27:37Z", "title": "Pathway: a fast and flexible unified stream data processing framework\n  for analytical and Machine Learning applications", "summary": "We present Pathway, a new unified data processing framework that can run\nworkloads on both bounded and unbounded data streams. The framework was created\nwith the original motivation of resolving challenges faced when analyzing and\nprocessing data from the physical economy, including streams of data generated\nby IoT and enterprise systems. These required rapid reaction while calling for\nthe application of advanced computation paradigms (machinelearning-powered\nanalytics, contextual analysis, and other elements of complex event\nprocessing). Pathway is equipped with a Table API tailored for Python and\nPython/SQL workflows, and is powered by a distributed incremental dataflow in\nRust. We describe the system and present benchmarking results which demonstrate\nits capabilities in both batch and streaming contexts, where it is able to\nsurpass state-of-the-art industry frameworks in both scenarios. We also discuss\nstreaming use cases handled by Pathway which cannot be easily resolved with\nstate-of-the-art industry frameworks, such as streaming iterative graph\nalgorithms (PageRank, etc.)."}
{"arxiv_id": "2307.13116v1", "published": "2023-07-12T08:27:37Z", "title": "Pathway: a fast and flexible unified stream data processing framework\n  for analytical and Machine Learning applications", "summary": "We present Pathway, a new unified data processing framework that can run\nworkloads on both bounded and unbounded data streams. The framework was created\nwith the original motivation of resolving challenges faced when analyzing and\nprocessing data from the physical economy, including streams of data generated\nby IoT and enterprise systems. These required rapid reaction while calling for\nthe application of advanced computation paradigms (machinelearning-powered\nanalytics, contextual analysis, and other elements of complex event\nprocessing). Pathway is equipped with a Table API tailored for Python and\nPython/SQL workflows, and is powered by a distributed incremental dataflow in\nRust. We describe the system and present benchmarking results which demonstrate\nits capabilities in both batch and streaming contexts, where it is able to\nsurpass state-of-the-art industry frameworks in both scenarios. We also discuss\nstreaming use cases handled by Pathway which cannot be easily resolved with\nstate-of-the-art industry frameworks, such as streaming iterative graph\nalgorithms (PageRank, etc.)."}
{"arxiv_id": "2403.11924v1", "published": "2024-03-18T16:23:46Z", "title": "Exploring Dielectric Properties in Models of Amorphous Boron Nitride", "summary": "We report a theoretical study of dielectric properties of models of amorphous\nBoron Nitride, using interatomic potentials generated by machine learning. We\nfirst perform first-principles simulations on small (about $100$ atoms in the\nperiodic cell) sample sizes to explore the emergence of mid-gap states and its\ncorrelation with structural features. Next, by using a simplified tight-binding\nelectronic model, we analyse the dielectric functions for complex three\ndimensional models (containing about $10.000$ atoms) embedding varying\nconcentrations of ${\\rm sp^{1}, sp^{2}}$ and ${\\rm sp^3}$ bonds between B and N\natoms. Within the limits of these methodologies, the resulting value of the\nzero-frequency dielectric constant is shown to be influenced by the population\ndensity of such mid-gap states and their localization characteristics. We\nobserve nontrivial correlations between the structure-induced electronic\nfluctuations and the resulting dielectric constant values. Our findings are\nhowever just a first step in the quest of accessing fully accurate dielectric\nproperties of as-grown amorphous BN of relevance for interconnect technologies\nand beyond."}
{"arxiv_id": "2403.09007v1", "published": "2024-03-14T00:04:13Z", "title": "Casimir repulsion with biased semiconductors", "summary": "Quantum and thermal fluctuations are fundamental to a plethora of phenomena\nwithin quantum optics, including the Casimir effect that acts between closely\nseparated surfaces typically found in MEMS and NEMS devices. Particularly\npromising for engineering and harnessing these forces are systems out of\nthermal equilibrium. Recently, semiconductors with external bias have been\nproposed to study the nonequilibrium Casimir force. Here, we explore systems\ninvolving moderately biased semiconductors that exhibit strong repulsive\nCasimir forces, and we determine the effects of bias voltage, semiconductor\nbandgap energy, and separation for experimentally accessible configurations.\nModes emitted from the semiconductors exert a repulsive force on a near surface\nthat overcomes the attractive equilibrium Casimir force contribution at\nsubmicron distances. For the geometry of two parallel planes, those modes\nundergo Fabry-P\\'erot interference resulting in an oscillatory force behavior\nas a function of separation. Utilizing the proximity-force approximation, we\npredict that the repulsive force exerted on a gold sphere is well within the\naccuracy of typical Casimir force experiments. Our work opens up new\npossibilities of controlling forces at the nano- and micrometer scale with\napplications in sensing and actuation in nanotechnology."}
{"arxiv_id": "2403.04864v1", "published": "2024-03-07T19:28:33Z", "title": "Thermodynamic properties of an electron gas in a two-dimensional quantum\n  dot: an approach using density of states", "summary": "Potential applications of quantum dots in the nanotechnology industry make\nthese systems an important field of study in various areas of physics. In\nparticular, thermodynamics has a significant role in technological innovations.\nWith this in mind, we studied some thermodynamic properties in quantum dots,\nsuch as entropy and heat capacity, as a function of the magnetic field over a\nwide range of temperatures. The density of states plays an important role in\nour analyses. At low temperatures, the variation in the magnetic field induces\nan oscillatory behavior in all thermodynamic properties. The depopulation of\nsubbands is the trigger for the appearance of the oscillations."}
{"arxiv_id": "2403.04302v1", "published": "2024-03-07T08:10:30Z", "title": "Experimental amplification and squeezing of a motional state of an\n  optically levitated nanoparticle", "summary": "A contactless control of fluctuations of phase space variables of a\nnanoobject belongs among the key methods needed for ultra-precise\nnanotechnology and the upcoming quantum technology of macroscopic systems. Here\nwe utilize the experimental platform of a single levitating nanoparticle (NP)\nto demonstrate essential protocols providing linear amplification of the\nmechanical phase space variables together with squeezing of phase space\nprobability distribution. The protocol combines a controlled fast switching\nbetween the parabolic trapping potential and either weak parabolic or inverted\nparabolic amplifying potential leading to amplification of mean value and\nvariance (fluctuations) along an arbitrary phase space variable and squeezing\nalong the complementary one. The protocol is completed with cold damping scheme\nto control the initial fluctuations of the NP phase space variables. We reached\nthe amplification gain $|G|>2$, the squeezing coefficient above 4 dB, and the\nsecond-order energy correlation function approaching 3 which corresponds to a\nmaximum for a stochastic non-equilibrium classical state. These experimental\nresults will already allow pre-amplification and manipulation of nanomechanical\nNP motion for all quantum protocols if the NP cooling towards the ground state\nis applied."}
{"arxiv_id": "2403.00213v2", "published": "2024-03-01T01:22:29Z", "title": "Design principles for fast and efficient self-assembly processes", "summary": "Self-assembly is a fundamental concept in biology and of significant interest\nto nanotechnology. Significant progress has been made in characterizing and\ncontrolling the properties of the resulting structures, both experimentally and\ntheoretically. However, much less is known about kinetic constraints and\ndeterminants of dynamical properties like time efficiency, although these\nconstraints can become severe limiting factors of self-assembly processes. Here\nwe investigate how the time efficiency and other dynamical properties of\nreversible self-assembly depend on the morphology (shape) of the building\nblocks for systems in which the binding energy between the constituents is\nlarge. As paradigmatic examples, we stochastically simulate the self-assembly\nof constituents with triangular, square, and hexagonal morphology into\ntwo-dimensional structures of a specified size. We find that the constituents'\nmorphology critically determines the assembly time and how it scales with the\nsize of the target structure. Our analysis reveals three key structural\nparameters defined by the morphology: The nucleation size and attachment order,\nwhich describe the effective order of the chemical reactions by which clusters\nnucleate and grow, respectively, and the growth exponent, which determines how\nthe growth rate of an emerging structure scales with its size. Using this\ncharacterization, we formulate an effective theory of the self-assembly\nkinetics, which we show exhibits an inherent scale invariance. This allows us\nto identify general scaling laws that describe the minimal assembly time as a\nfunction of the size of the target structure. We show how these insights on the\nkinetics of self-assembly processes can be used to design assembly schemes that\ncould significantly increase the time efficiency and robustness of artificial\nself-assembly processes."}
{"arxiv_id": "2402.13980v1", "published": "2024-02-21T18:09:12Z", "title": "Geometry-induced wavefunction collapse", "summary": "When a quantum particle moves in a curved space, a geometric potential can\narise. In spite of a long history of extensive theoretical studies, to\nexperimentally observe the geometric potential remains to be a challenge. What\nare the physically observable consequences of such a geometric potential?\nSolving the Schrodinger equation on a truncated conic surface, we uncover a\nclass of quantum scattering states that bear a strong resemblance with the\nquasi-resonant states associated with atomic collapse about a Coulomb impurity,\na remarkable quantum phenomenon in which an infinite number of quasi-resonant\nstates emerge. A characteristic defining feature of such collapse states is the\ninfinite oscillations of the local density of states (LDOS) about the zero\nenergy point separating the scattering from the bound states. The emergence of\nsuch states in the curved (Riemannian) space requires neither a relativistic\nquantum mechanism nor any Coulomb impurity: they have zero angular momentum and\ntheir origin is purely geometrical - henceforth the term geometry-induced\nwavefunction collapse. We establish the collapsing nature of these states\nthrough a detailed comparative analysis of the behavior of the LDOS for both\nthe zero and finite angular-momentum states as well as the corresponding\nclassical picture. Potential experimental schemes to realize the\ngeometry-induced collapse states are articulated. Not only has our study\nuncovered an intrinsic connection between the geometric potential and atomic\ncollapse, it also provides a method to experimentally observe and characterize\ngeometric potentials arising from different subfields of physics. For example,\nin nanoscience and nanotechnology, curved geometry has become increasingly\ncommon. Our finding suggests that wavefunction collapse should be an important\nfactor of consideration in designing and developing nanodevices."}
{"arxiv_id": "2402.11646v1", "published": "2024-02-18T16:56:27Z", "title": "Computational Kerr-Ellipsometry: Quantifying Broadband Optical\n  Nonreciprocity of Magneto-Optic Materials", "summary": "Characterizing the optical response of magneto-optic and magnetic materials\nusually relies on semi-classical models (e.g. Lorentz oscillator model)\ninvolving few parameters or models based on a detailed quantum mechanical\ndescription of the underlying response. These models typically involve a few\nparameters that are estimated via fitting the experimental data to provide a\nqualitative understanding of the underlying physics. Such a few-parameters\nfitting approach falls short of accurately capturing all elements of the\ncomplex-valued permittivity tensor across a range of wavelengths. Accurate\ncharacterization of the permittivity tensor elements across a broad range of\nwavelengths is invariably imperative for designing optical elements such as\nisolators, circulators, etc. Here, we propose and demonstrate a ubiquitous and\naccessible method based on a combination of spectroscopic ellipsometry and\nspectroscopic Magneto-Optic Kerr Effect (MOKE) measurements coupled with\nrigorous numerical parameter extraction techniques. To this end, we use the\ncombined MOKE ellipsometry measurements conducted at different angles of\nincidence with a gradient-descent minimization algorithm to provide the inverse\nsolution to the complete dielectric permittivity tensor. Further, we\ndemonstrate model re-verification to ensure the estimated dielectric\npermittivity values reliably predict the measured experimental data. Our method\nis a simplified bench-top counterpart to the otherwise complex measurement\nsystems."}
{"arxiv_id": "2402.08553v1", "published": "2024-02-13T15:55:58Z", "title": "Incidence of the Brownian relaxation process on the magnetic properties\n  of ferrofluids", "summary": "Ferrofluids containing magnetic nanoparticles represent a special class of\nmagnetic materials due to the added freedom of particle tumbling in the fluids.\nWe studied this process, known as Brownian relaxation, and its effect on the\nmagnetic properties of ferrofluids with controlled magnetite nanoparticle\nsizes. For small nanoparticles (below 10 nm diameter) the N\\'eel process is\nexpected to dominate the magnetic response, whereas for larger particles,\nBrownian relaxation becomes important. Temperature- and magnetic\nfield-dependent magnetization studies, differential scanning calorimetry, and\nAC susceptibility measurements were carried out for 6, 8, 10.6, and 13.5 nm\ndiameter magnetite nanoparticles suspended in water. We identify clear\nfingerprints of the Brownian relaxation for the sample of the large diameter\nnanoparticles as both magnetic and thermal hysteresis develop at the water\nfreezing temperature, whereas the samples of small diameter nanoparticles\nremain hysteresis-free down to the magnetic blocking temperature. This is\nsupported by the temperature-dependent AC susceptibility measurements: above\n273 K, the data show a low-frequency Debye peak, which is characteristic of the\nBrownian relaxation. This peak vanishes below 273 K."}
{"arxiv_id": "2402.06292v1", "published": "2024-02-09T10:14:07Z", "title": "Towards full control of molecular exciton energy transfer via FRET in\n  DNA origami assemblies", "summary": "Controlling the flow of excitons between organic molecules holds immense\npromise for various applications, including energy conversion, spectroscopy,\nphotocatalysis, sensing, and microscopy. DNA nanotechnology has shown promise\nin achieving this control by using synthetic DNA as a platform for positioning\nand, very recently, for also orienting organic dyes. In this study, the\norientation of doubly-linked dyes in DNA origami structures was manipulated to\ncontrol energy transfer. By controlling independently the orientation of single\ndonor and acceptor molecules, the average energy transfer efficiency was\ndoubled. This work demonstrates the potential of DNA nanotechnology for precise\ncontrol of the excitonic energy transfer with implications for artificial\nlight-harvesting antennas."}
{"arxiv_id": "2402.04748v1", "published": "2024-02-07T11:04:48Z", "title": "Electron qubits surfing on acoustic waves: review of recent progress", "summary": "The displacement of a single electron enables exciting avenues for\nnanotechnology with vast application potential in quantum metrology, quantum\ncommunication and quantum computation. Surface acoustic waves (SAW) have proven\nitself as a surprisingly useful solution to perform this task over large\ndistance with outstanding precision and reliability. Over the last decade,\nimportant milestones have been achieved bringing SAW-driven single-electron\ntransport from first proof-of-principle demonstrations to accurate,\nhighly-controlled implementations, such as coherent spin transport,\ncharge-to-photon conversion, or antibunching of charge states. Beyond the\nwell-established piezoelectric gallium-arsenide platform, first realisations of\nacousto-electronic transport have also been carried out on the surface of\nliquid helium. In this review article, we aim to keep track of this remarkable\nprogress by explaining these recent achievements from basic principles, with an\noutlook on follow-up experiments and near-term applications."}
{"arxiv_id": "2402.13260v1", "published": "2024-02-05T08:38:41Z", "title": "Magnetic Nanoparticles for Neural Engineering", "summary": "Magnetic nanoparticles (MNPs) are the foundation of several new strategies\nfor neural repair and neurological therapies. The fact that a remote force can\nact on MNPs at the cytoplasmic space constitutes the essence of many new\nneurotherapeutic concepts. MNPs with a predesigned physicochemical\ncharacteristic can interact with external magnetic fields to apply mechanical\nforces in definite areas of the cell to modulate cellular behaviour. Magnetic\nactuation to direct the outgrowth on neurons after nerve injury has already\ndemonstrated the therapeutic potential for neural repair. When these magnetic\ncores are functionalized with molecules such as nerve growth factors or\nneuroprotective molecules, multifunctional devices can be developed. This\nchapter will review some of these new nanotechnology-based solutions for\nneurological diseases, specifically those based on the use of engineered MNPs\nused for neuroprotection and neuroregeneration. These include the use of MNPs\nas magnetic actuators to guide neural cells, modulate intracellular transport\nand stimulate axonal growth after nerve injury."}
{"arxiv_id": "2402.00216v1", "published": "2024-01-31T22:34:28Z", "title": "Structural and optical properties of self-assembled AlN nanowires grown\n  on SiO2/Si substrates by molecular beam epitaxy", "summary": "Self assembled AlN nanowires (NWs) are grown by plasma assisted molecular\nbeam epitaxy (PAMBE) on SiO2 / Si (111) substrates. Using a combination of\nin-situ reflective high energy electron diffraction and ex situ X ray\ndiffraction (XRD), we show that the NWs grow nearly strain free, preferentially\nperpendicular to the amorphous SiO2 interlayer and without epitaxial\nrelationship to Si(111) substrate, as expected. Scanning electron microscopy\ninvestigation reveals significant NWs coalescence, which results in their\nprogressively increasing diameter and formation of columnar structures with non\nhexagonal cross section. Making use of scanning transmission electron\nmicroscopy (STEM), the NWs initial diameters are found in the 20 to 30 nm\nrange. In addition, the formation of a thin (30 nm) polycrystalline AlN layer\nis observed on the substrate surface. Regarding the structural quality of the\nAlN NWs, STEM measurements reveal the formation of extended columnar regions,\nwhich grow with a virtually perfect metal-polarity wurtzite arrangement and\nwith extended defects only sporadically observed. Combination of STEM and\nelectron energy loss spectroscopy (EELS) reveals the formation of continuous\naluminum oxide (1 to 2 nm) on the NW surface. Low temperature photoluminescence\nmeasurements reveal a single near band edge (NBE) emission peak, positioned at\n6.03 eV (at 2 K), a value consistent with nearly zero NW strain evidenced by\nXRD and in agreement with the values obtained on AlN bulk layers synthesized by\nother growth techniques. The significant full width at half maximum of NBE\nemission, found at 20 meV (at 2 K), suggests that free and bound excitons are\nmixed together within this single emission band."}
{"arxiv_id": "2401.16794v2", "published": "2024-01-30T07:12:32Z", "title": "Simulation aspects of patterning polymer films via evaporative\n  lithography and composite substrates", "summary": "The continuing development of evaporative lithography is important for many\nareas such as the creation of photonic crystals for optronics and\nmicroelectronics, the development of biosensors for medical applications and\nbiotechnology, and for the formation of functional coatings for nanotechnology,\nincluding the application of thin, protective polymer coatings. The article\nproposes a mathematical model that allows us to explain the basic mechanisms of\nthe formation of thin polymer films (less than 50 $\\mu$m thick) during their\ndeposition onto a composite substrate by methanol evaporation from a solution.\nIf the thermal conductivity of the substrate is spatially non-uniform, this\nresults in inhomogeneous evaporation along the free film surface. Therefore, as\nthe film dries, a patterned polymer coating is left behind on the substrate.\nThe mathematical model described here is based on the lubrication approximation\nand takes into account the dependence of the solution density on the\nconcentration. The numerical computation results are in qualitative agreement\nwith the experimental data of other authors. The article shows that solutal\nMarangoni flow plays a primary role in the process under consideration. This\nstudy allows us to better understand the mechanisms that can be used in\nevaporative lithography."}
{"arxiv_id": "2401.14783v1", "published": "2024-01-26T11:15:38Z", "title": "E-Beam Induced Micropattern Generation and Amorphization of\n  L-Cysteine-Functionalized Graphene Oxide Nano-composites", "summary": "The evolution of dynamic processes in graphene-family materials are of great\ninterest for both scientific purposes and technical applications. Scanning\nelectron microscopy and transmission electron microscopy outstand among the\ntechniques that allow both observing and controlling such dynamic processes in\nreal time. On the other hand, functionalized graphene oxide emerges as a\nfavorable candidate from graphene-family materials for such an investigation\ndue to its distinctive properties, that encompass a large surface area, robust\nthermal stability, and noteworthy electrical and mechanical properties after\nits reduction. Here, we report on studies of surface structure and adsorption\ndynamics of L-Cysteine on electrochemically exfoliated graphene oxides basal\nplane. We show that electron beam irradiation prompts an amorphization of\nfunctionalized graphene oxide along with the formation of micropatterns of\ncontrolled geometry composed of L-Cysteine-Graphene oxide nanostructures. The\ncontrolled growth and predetermined arrangement of micropatterns as well as\ncontrolled structure disorder induced by e beam amorphization, in its turn\npotentially offering tailored properties and functionalities paving the way for\npotential applications in nanotechnology, sensor development, and surface\nengineering. Our findings demonstrate that graphene oxide can cover L-Cysteine\nin such a way to provide a control on the positioning of emerging\nmicrostructures about 10-20 um in diameter. Besides, Raman and SAED measurement\nanalyses yield above 50% amorphization in a material. The results of our\nstudies demonstrate that such a technique enables the direct creation of\nmicropatterns of L-Cysteine-Graphene oxide eliminating the need for complicated\nmask patterning procedures."}
{"arxiv_id": "2401.14651v1", "published": "2024-01-26T05:17:48Z", "title": "Nonlocal Models in Biology and Life Sciences: Sources, Developments, and\n  Applications", "summary": "Nonlocality is important in realistic mathematical models of physical and\nbiological systems at small-length scales. It characterizes the properties of\ntwo individuals located in different locations. This review illustrates\ndifferent nonlocal mathematical models applied to biology and life sciences.\nThe major focus has been given to sources, developments, and applications of\nsuch models. Among other things, a systematic discussion has been provided for\nthe conditions of pattern formations in biological systems of population\ndynamics. Special attention has also been given to nonlocal interactions on\nnetworks, network coupling and integration, including models for brain dynamics\nthat provide us with an important tool to better understand neurodegenerative\ndiseases. In addition, we have discussed nonlocal modelling approaches for\ncancer stem cells and tumor cells that are widely applied in the cell migration\nprocesses, growth, and avascular tumors in any organ. Furthermore, the\ndiscussed nonlocal continuum models can go sufficiently smaller scales applied\nto nanotechnology to build biosensors to sense biomaterial and its\nconcentration. Piezoelectric and other smart materials are among them, and\nthese devices are becoming increasingly important in the digital and physical\nworld that is intrinsically interconnected with biological systems.\nAdditionally, we have reviewed a nonlocal theory of peridynamics, which deals\nwith continuous and discrete media and applies to model the relationship\nbetween fracture and healing in cortical bone, tissue growth and shrinkage, and\nother areas increasingly important in biomedical and bioengineering\napplications. Finally, we provided a comprehensive summary of emerging trends\nand highlighted future directions in this rapidly expanding field."}
{"arxiv_id": "2401.13258v1", "published": "2024-01-24T06:54:41Z", "title": "Novel 3D Reciprocal Space Visualization of Strain Relaxation in InSb on\n  GaAs Substrates", "summary": "This study introduces the Reciprocal Space Polar Visualization (RSPV) method,\na novel approach for visualizing X-ray diffraction-based reciprocal space data.\nRSPV allows for the precise separation of tilt and strain, facilitating their\nindividual analysis. InSb was grown by molecular beam epitaxy (MBE) on two\n(001) GaAs substrates $\\unicode{x2014}$ one with no misorientation (Sample A)\n$\\unicode{x2014}$ one with 2{\\deg} surface misorientation from the (001) planes\n(Sample B). There is a substantial lattice mismatch with the substrate and this\nresults in the generation of defects within the InSb layer during growth. To\ndemonstrate RSPV's effectiveness, a comprehensive comparison of surface\nmorphology, dislocation density, strain, and tilt was conducted. RSPV revealed\npreviously unobserved features of the (004) InSb Bragg peak, partially\nexplained by the presence of threading dislocations and oriented abrupt steps\n(OASs). Surface morphologies examined by an atomic force microscope (AFM)\nrevealed that Sample B had significantly lower root mean square (RMS)\nroughness. Independent estimates of threading dislocation density (TDD) using\nX-ray diffraction (XRD) and electron channelling contrast imaging (ECCI)\nconfirmed that Sample B exhibited a significantly lower TDD than Sample A. XRD\nmethods further revealed unequal amounts of $\\alpha$ and $\\beta$ type threading\ndislocations in both samples, contributing to an anisotropic Bragg peak. RSPV\nis shown to be a robust method for exploring 3D reciprocal space in any\ncrystal, demonstrating that growing InSb on misoriented GaAs produced a\nhigher-quality crystal compared to an on-orientation substrate."}
{"arxiv_id": "2401.11541v1", "published": "2024-01-21T16:46:04Z", "title": "Multi-View Neural 3D Reconstruction of Micro-/Nanostructures with Atomic\n  Force Microscopy", "summary": "Atomic Force Microscopy (AFM) is a widely employed tool for micro-/nanoscale\ntopographic imaging. However, conventional AFM scanning struggles to\nreconstruct complex 3D micro-/nanostructures precisely due to limitations such\nas incomplete sample topography capturing and tip-sample convolution artifacts.\nHere, we propose a multi-view neural-network-based framework with AFM\n(MVN-AFM), which accurately reconstructs surface models of intricate\nmicro-/nanostructures. Unlike previous works, MVN-AFM does not depend on any\nspecially shaped probes or costly modifications to the AFM system. To achieve\nthis, MVN-AFM uniquely employs an iterative method to align multi-view data and\neliminate AFM artifacts simultaneously. Furthermore, we pioneer the application\nof neural implicit surface reconstruction in nanotechnology and achieve\nmarkedly improved results. Extensive experiments show that MVN-AFM effectively\neliminates artifacts present in raw AFM images and reconstructs various\nmicro-/nanostructures including complex geometrical microstructures printed via\nTwo-photon Lithography and nanoparticles such as PMMA nanospheres and ZIF-67\nnanocrystals. This work presents a cost-effective tool for micro-/nanoscale 3D\nanalysis."}
{"arxiv_id": "2401.11192v1", "published": "2024-01-20T10:03:56Z", "title": "Smart Drug-Delivery Systems for Cancer Nanotherapy", "summary": "Despite all the advances achieved in the field of tumor-biology research, in\nmost cases conventional therapies including chemotherapy are still the leading\nchoices. The main disadvantage of these treatments, in addition to the low\nsolubility of many antitumor drugs, is their lack of specificity, which\nexplains the frequent occurrence of serious side effects due to nonspecific\ndrug uptake by healthy cells. Progress in nanotechnology and its application in\nmedicine have provided new opportunities and different smart systems. Such\nsystems can improve the intracellular delivery of the drugs due to their\nmultifunctionality and targeting potential. The purpose of this manuscript is\nto review and analyze the recent progress made in nanotherapy applied to cancer\ntreatment. First, we provide a global overview of cancer and different smart\nnanoparticles currently used in oncology. Then, we analyze in detail the\ndevelopment of drug-delivery strategies in cancer therapy, focusing mainly on\nthe intravenously administered smart nanoparticles with protein corona to avoid\nimmune-system clearance. Finally, we discuss the challenges, clinical trials,\nand future directions of the nanoparticle-based therapy in cancer."}
{"arxiv_id": "2401.10365v1", "published": "2024-01-18T20:14:14Z", "title": "Recent Nanoninformatics Approaches for Developments in Nanobiotechnology\n  and Nanomedicine", "summary": "Nanoinformatics is a novel, rapidly growing area of research that involves\nthe application of computational techniques to several aspects of research in\nthe field of nanotechnology, especially concerned its application to\nbiotechnology. This reviews aims to explore, summarize and categorize recent\npublications on the subject."}
{"arxiv_id": "2401.08963v1", "published": "2024-01-17T04:35:46Z", "title": "A critical review on recent progress of solution-processed monolayer\n  assembly of nanomaterials and applications", "summary": "The rapid development in nanotechnology has necessitated accurate and\nefficient assembly strategies for nanomaterials. Monolayer assembly of\nnanomaterials (MAN) represents an extreme challenge in manufacturing and is\ncritical in understanding interactions among nanomaterials, solvents, and\nsubstrates. MAN enables highly tunable performance in electronic and photonic\ndevices. This review summarizes the recent progress on the methods to achieve\nMAN and discusses important control factors. Moreover, the importance of MAN is\nelaborated by a broad range of applications in electronics and photonics. In\nthe end, we outlook the opportunities as well as challenges in manufacturing\nand new applications."}
{"arxiv_id": "2401.06260v2", "published": "2024-01-11T21:11:23Z", "title": "Nanoalignment by Critical Casimir Torques", "summary": "The manipulation of microscopic objects requires precise and controllable\nforces and torques. Recent advances have led to the use of critical Casimir\nforces as a powerful tool, which can be finely tuned through the temperature of\nthe environment and the chemical properties of the involved objects. For\nexample, these forces have been used to self-organize ensembles of particles\nand to counteract stiction caused by Casimir-Liftshitz forces. However, until\nnow, the potential of critical Casimir torques has been largely unexplored.\nHere, we demonstrate that critical Casimir torques can efficiently control the\nalignment of microscopic objects on nanopatterned substrates. We show\nexperimentally and corroborate with theoretical calculations and Monte Carlo\nsimulations that circular patterns on a substrate can stabilize the position\nand orientation of microscopic disks. By making the patterns elliptical, such\nmicrodisks can be subject to a torque which flips them upright while\nsimultaneously allowing for more accurate control of the microdisk position.\nMore complex patterns can selectively trap 2D-chiral particles and generate\nparticle motion similar to non-equilibrium Brownian ratchets. These findings\nprovide new opportunities for nanotechnological applications requiring precise\npositioning and orientation of microscopic objects."}
{"arxiv_id": "2401.04440v1", "published": "2024-01-09T09:08:14Z", "title": "Frontier science in a quantum experiment: AEgIS at CERN", "summary": "Precise manipulation of matter at the atomic or molecular level has provided\nthe path for the nanotechnological revolution impacting diverse fields such as\nbiology, medicine, material science, quantum technologies, and electronics. At\nthe Antiproton Decelerator facility at CERN, the AEgIS experiment utilises\nstate-of-the-art technology to store and manipulate synthesised exotic atoms\ncontaining both matter and antimatter. Such experiments lay the groundwork for\na better understanding of the fundamental interactions and hold the potential\nto unravel the enigma of the absence of antimatter in our universe.\nAdditionally, the developed techniques advance the technological frontier of\ncontrolling the quantum states of ions, a critical aspect of quantum sensing\nand quantum computing applications."}
{"arxiv_id": "2401.02321v1", "published": "2024-01-04T15:41:46Z", "title": "Deep Learning for Optical Tweezers", "summary": "Optical tweezers exploit light--matter interactions to trap particles ranging\nfrom single atoms to micrometer-sized eukaryotic cells. For this reason,\noptical tweezers are a ubiquitous tool in physics, biology, and nanotechnology.\nRecently, the use of deep learning has started to enhance optical tweezers by\nimproving their design, calibration, and real-time control as well as the\ntracking and analysis of the trapped objects, often outperforming classical\nmethods thanks to the higher computational speed and versatility of deep\nlearning. Here, we review how deep learning has already remarkably improved\noptical tweezers, while exploring the exciting, new future possibilities\nenabled by this dynamic synergy. Furthermore, we offer guidelines on\nintegrating deep learning with optical trapping and optical manipulation in a\nreliable and trustworthy way."}
{"arxiv_id": "2401.00944v1", "published": "2024-01-01T19:34:07Z", "title": "Hot electrons and electromagnetic effects in the broadband Au, Ag, and\n  Ag-Au nanocrystals: The UV, visible, and NIR plasmons", "summary": "Energetic and optical properties of plasmonic nanocrystals strongly depend on\ntheir sizes, shapes, and composition. Whereas using plasmonic nanoparticles in\nbiotesting has become routine, applications of plasmonics in energy are still\nearly in development. Here, we investigate hot electron (HE) generation and\nrelated electromagnetic effects in both mono- and bi-metallic nanorods (NRs)\nand focus on one promising type of bi-metallic nanocrystals - core-shell Au-Ag\nnanorods. The spectra of the NRs are broadband, highly tunable with their\ngeometry, and have few plasmon resonances. In this work, we provide a new\nquantum formalism describing the HE generation in bi-metallic nanostructures.\nInterestingly, we observe that the HE generation rate at the UV plasmon\nresonance of Au-Ag NRs appears to be very high. These HEs are highly energetic\nand suitable for carbon-fuel reactions. Simultaneously, the HE generation at\nthe longitudinal plasmon (L-plasmon) peaks, which can be tuned from the yellow\nto near-IR, depends on the near-field and electromagnetic Mie effects, limiting\nthe HE efficiencies for the long and large NRs. These properties of the\nL-plasmon relate to all kinds of NRs (Au, Ag, and Au-Ag). We also consider the\ngeneration of the interband d-holes in Au and Ag, since the involvement of the\nd-band is crucial for the energetic properties of UV plasmons. The proposed\nformalism is an important development for the description of bi-metallic (or\ntri-metallic, or more complex) nanostructures, and it paves the way to the\nefficient application of the plasmonic HEs and hot holes in sensing,\nnanotechnology, photocatalysis, and electrophotochemistry."}
{"arxiv_id": "2401.00346v1", "published": "2023-12-30T23:15:15Z", "title": "Internet of Harvester Nano Things: A Future Prospects", "summary": "The advancements in nanotechnology, material science, and electrical\nengineering have shrunk the sizes of electronic devices down to the\nmicro/nanoscale. This brings the opportunity of developing the Internet of Nano\nThings (IoNT), an extension of the Internet of Things (IoT). With nanodevices,\nnumerous new possibilities emerge in the biomedical, military fields, and\nindustrial products. However, a continuous energy supply is needed for these\ndevices to work. At the micro/nanoscale, batteries cannot supply this demand\ndue to size limitations and the limited energy contained in the batteries.\nInternet of Harvester Nano Things (IoHNT), a concept of Energy Harvesting (EH),\nwhich converts the existing different energy sources, which otherwise would be\ndissipated to waste, into electrical energy via electrical generators. Sources\nfor EH are abundant, from sunlight, sound, water, and airflow to living\norganisms. IoHNT methods are significant assets to ensure the proper operation\nof the IoNT; thus, in this review, we comprehensively investigate the most\nuseful energy sources and IoHNT principles to power the nano/micro-scaled\nelectronic devices with the scope of IoNT. We discuss the IoHNT principles,\nmaterial selections, challenges, and state-of-the-art applications of each\nenergy source for both in-vivo and in vitro applications. Finally, we present\nthe latest challenges of EH along with future research directions to solve the\nproblems regarding constructing continuous IoNT containing various self-powered\nnanodevices. Therefore, IoHNT represents a significant shift in nanodevice\npower supply, leading us towards a future where wireless technology is\nwidespread. Hence, it will motivate researchers to envision and contribute to\nthe advancement of the following power revolution in IoNT, providing unmatched\nsimplicity and efficiency."}
{"arxiv_id": "2312.13812v1", "published": "2023-12-21T13:04:42Z", "title": "Gain enhanced metal nanoshells: below and above the emission threshold", "summary": "Nanotechnology has revolutionized our ability to control matter at the\nnanoscale, with metallic nanostructures offering remarkable versatility.\nMetallic nanoparticles (MNs) find compelling applications when metal losses are\nbalanced by optical gain elements, including visible-frequency metamaterial\ncloaking and sensitive bio-molecular sensors. Prior studies of the\nelectromagnetic response of these nano-systems have focused on single spherical\nMNs within infinite gain media, facing non-uniformity challenges beyond\nemission thresholds. To overcome this issue, we propose transitioning to\nspherical nanoshells incorporating gain elements, facilitating field\nhomogeneity and offering a comprehensive spectral description using a hybrid\nquasi-static model. This system enables us to describe the electromagnetic\nbehavior of the MN below as well as above the emission threshold.\nInterestingly, we found that the steady-state emission of a gain enhanced\nnanoshell is not the single line emission predicted by other authors, but\ninstead it involves a range of frequencies whose span is governed by physical\nand morphological parameters that can be chosen at the stage of synthesis to\ndesign an optimal emitter."}
{"arxiv_id": "2401.06778v1", "published": "2023-12-21T09:26:41Z", "title": "Fermi-Level Pinning and Barrier Height Control at epitaxially grown\n  ferromagnet/ZnO/metal Schottky Interfaces for opto-spintronics applications", "summary": "Schottky contacts (SC) at the ferromagnet/ZnO interface are good candidates\nfor the realization and control of several semiconductor emerging magnetic\nphenomena such spin injection and spin-controlled photonics. In this work, we\ndemonstrate the epitaxial growth of single-phase and wurtzite-ZnO thin films on\nfcc Pt/Co$_{0.30}$Pt$_{0.70}$ (111) electrodes by MBE technique. While the\nmagnetic properties of the Pt/Co$_{0.30}$Pt$_{0.70}$ buffer remain unchanged\nafter the ZnO growth, the electric measurements of back-to-back Schottky diodes\nrevealed a Schottky barrier height at the metal/ZnO interfaces in the range of\n590-690 meV using Cu, Pt and Co$_{0.30}$Pt$_{0.70}$ contacts. A pinning factor\nS and a charge neutrality level (CNL) ${\\Phi}_{CNL}$ of 0.08 and 4.94 eV,\nrespectively, were obtained indicating a strong Fermi-level pining with a CNL\nlevel that lies 0.64 eV below the conductance band of ZnO semiconductor. These\nexperimental findings indicate that Co$_{0.30}$Pt$_{0.70}$/ZnO interface\nfollows the metal-induced gap states model and can open a pathway for the\nrealization of opto-spintronics applications such spin-LEDs."}
{"arxiv_id": "2312.13479v1", "published": "2023-12-20T23:18:42Z", "title": "Designing 3D multicomponent self-assembling systems with signal-passing\n  building blocks", "summary": "We introduce allostery-mimetic building blocks model for self-assembly of 3D\nstructures. We represent the building blocks as patchy particles, where each\nbinding site (patch) can be irreversibly activated or deactivated by binding of\nthe particle's other controlling patches to another particle. We show that\nthese allostery-mimetic systems can be designed to increase yields of target\nstructures by disallowing mis-assembled states, and can further decrease the\nsmallest number of distinct species needed to assemble a target structure.\nNext, we show applications to design of a programmable nanoparticle swarm for\nmultifarious assembly: a system of particles which stores multiple possible\ntarget structures, and a particular structure is recalled by presenting an\nexternal trigger signal. Finally, we outline a possible pathway to realization\nof such structures at nanoscale using DNA nanotechnology devices."}
{"arxiv_id": "2312.09136v1", "published": "2023-12-14T17:08:14Z", "title": "Tailoring Amorphous Boron Nitride for High-Performance 2D Electronics", "summary": "Two-dimensional (2D) materials have garnered significant attention in recent\nyears due to their atomically thin structure and unique electronic and\noptoelectronic properties. To harness their full potential for applications in\nnext-generation electronics and photonics, precise control over the dielectric\nenvironment surrounding the 2D material is critical. The lack of nucleation\nsites on 2D surfaces to form thin, uniform dielectric layers often leads to\ninterfacial defects that degrade the device performance, posing a major\nroadblock in the realization of 2D-based devices. Here, we demonstrate a\nwafer-scale, low-temperature process (< 250 {\\deg}C) using atomic layer\ndeposition (ALD) for the synthesis of uniform, conformal amorphous boron\nnitride (aBN) thin films. ALD deposition temperatures between 125 and 250\n{\\deg}C result in stoichiometric films with high oxidative stability, yielding\na dielectric strength of 8.2 MV/cm. Utilizing a seed-free ALD approach, we form\nuniform aBN dielectric layers on 2D surfaces and fabricate multiple quantum\nwell structures of aBN/MoS2 and aBN-encapsulated double-gated monolayer (ML)\nMoS2 field-effect transistors to evaluate the impact of aBN dielectric\nenvironment on MoS2 optoelectronic and electronic properties. Our work in\nscalable aBN dielectric integration paves a way towards realizing the\ntheoretical performance of 2D materials for next-generation electronics."}
{"arxiv_id": "2312.07380v1", "published": "2023-12-12T15:54:45Z", "title": "Optical time-harmonic elastography for multiscale stiffness mapping\n  across the phylogenetic tree", "summary": "Rapid mapping of the mechanical properties of soft biological tissues from\nlight microscopy to macroscopic imaging could transform fundamental biophysical\nresearch by providing clinical biomarkers to complement in vivo elastography.\nWe here introduce superfast optical time-harmonic elastography (OTHE) to\nremotely encode surface and subsurface shear wave fields for generating maps of\ntissue stiffness with unprecedented detail resolution. OTHE rigorously exploits\nthe space-time propagation characteristics of time-harmonic waves to address\ncurrent limitations of biomechanical imaging and elastography. Key solutions\nare presented for stimulation, encoding, and stiffness reconstruction of\ntime-harmonic, multifrequency shear waves, all tuned to provide consistent\nstiffness values across resolutions from microns to millimeters. OTHE's\nversatility is demonstrated in Bacillus subtilis biofilms, zebrafish embryos,\nadult zebrafish, and human skeletal muscle, reflecting the diversity of the\nphylogenetic tree from a mechanics perspective. By zooming in on stiffness\ndetails from coarse to finer scales, OTHE advances developmental biology and\noffers a way to perform biomechanics-based tissue histology that consistently\nmatches in vivo time-harmonic elastography in patients."}
{"arxiv_id": "2312.07594v1", "published": "2023-12-11T10:13:53Z", "title": "On the Prediction of Hardware Security Properties of HLS Designs Using\n  Graph Neural Networks", "summary": "High-level synthesis (HLS) tools have provided significant productivity\nenhancements to the design flow of digital systems in recent years, resulting\nin highly-optimized circuits, in terms of area and latency. Given the evolution\nof hardware attacks, which can render them vulnerable, it is essential to\nconsider security as a significant aspect of the HLS design flow. Yet the need\nto evaluate a huge number of functionally equivalent de-signs of the HLS design\nspace challenges hardware security evaluation methods (e.g., fault injection -\nFI campaigns). In this work, we propose an evaluation methodology of hardware\nsecurity properties of HLS-produced designs using state-of-the-art Graph Neural\nNetwork (GNN) approaches that achieves significant speedup and better\nscalability than typical evaluation methods (such as FI). We demonstrate the\nproposed methodology on a Double Modular Redundancy (DMR) coun-termeasure\napplied on an AES SBox implementation, en-hanced by diversifying the redundant\nmodules through HLS directives. The experimental results show that GNNs can be\nefficiently trained to predict important hardware security met-rics concerning\nfault attacks (e.g., critical and detection error rates), by using regression.\nThe proposed method predicts the fault vulnerability metrics of the HLS-based\ndesigns with high R-squared scores and achieves huge speedup compared to fault\ninjection once the training of the GNN is completed."}
{"arxiv_id": "2312.05600v3", "published": "2023-12-09T16:02:22Z", "title": "Continuous spectral and coupling-strength encoding with dual-gradient\n  metasurfaces", "summary": "Enhancing and controlling light-matter interactions is crucial in\nnanotechnology and material science, propelling research on green energy, laser\ntechnology, and quantum cryptography. Central to enhanced light-matter coupling\nare two parameters: the spectral overlap between an optical cavity mode and the\nmaterial's spectral features (e.g., excitonic or molecular absorption lines),\nand the quality factor of the cavity. Controlling both parameters\nsimultaneously is vital, especially in complex systems requiring extensive data\nto uncover the numerous effects at play. However, so far, photonic approaches\nhave focused solely on sampling a limited set of data points within this 2D\nparameter space. Here we introduce a nanophotonic approach that can\nsimultaneously and continuously encode the spectral and quality factor\nparameter space of light-matter interactions within a compact spatial area. Our\nnovel dual-gradient metasurface design is composed of a 2D array of smoothly\nvarying subwavelength nanoresonators, each supporting a unique mode. This\nresults in 27,500 distinct modes within one array and a resonance density\napproaching the theoretical upper limit for metasurfaces. By applying our\ndual-gradient to surface-enhanced molecular sensing, we demonstrate the\nimportance of coupling tailoring and unveil an additional coupling-based\ndimension of spectroscopic data. Our metasurface design paves the way for\ngeneralized light-matter coupling metasurfaces, leading to advancements in the\nfield of photocatalysis, chemical sensing, and entangled photon generation."}
{"arxiv_id": "2312.04531v1", "published": "2023-12-07T18:50:09Z", "title": "Electrostatic-driven Self-assembly of Janus-like Monolayer-protected\n  Metal Nanoclusters", "summary": "The generation of controlled microstructures of functionalized nanoparticles\nhas been one of the crucial challenges in nanoscience and nanotechnology.\nEfforts have been made to tune ligand charge states that can affect the\naggregation propensity and modulate the self-assembled structures. In this\nwork, we modelled zwitterionic Janus-like monolayer ligand-protected metal\nnanoclusters (J-MPCs) and studied their self-assembly using atomistic molecular\ndynamics and advanced enhanced sampling simulations. The oppositely-charged\nligands functionalization on two hemispheres of a J-MPC elicits asymmetric\nsolvation, primarily driven by distinctive hydrogen bonding patterns in the\nligand-solvent interactions. Electrostatic interactions between the oppositely\ncharged residues in J-MPCs guide the formation of one-dimensional and ring-like\nself-assembled superstructures with molecular dipoles oriented in specific\npatterns. The pertinent atomistic insights into the intermolecular interactions\ngoverning the self-assembled structures of zwitterionic J-MPCs obtained from\nthis work can be used to design a general strategy to create tunable\nmicrostructures of charged MPCs."}
{"arxiv_id": "2311.18410v1", "published": "2023-11-30T09:59:55Z", "title": "Richard Feynman's talent for finding things out", "summary": "This article is a summary of a talk about Richard Feynman, given at a\nconference Polymaths across the Eras organized in November 2023 by the St Cross\nCentre for the History and Philosophy of Physics (HAPP) in Oxford. It describes\nFeynman as an unconventional polymath, primarily concerned with his own\nunderstanding of nature, having little regard for previous authorities. His\ncuriosity, respect for experiment, ability to calculate and notable ingenuity\nled to important developments in quantum mechanics, quantum electrodynamics,\nand strong interactions. In particle physics, Feynman diagrams have been a\nmainstay of calculation for the last 75 years. His relish for the spoken word\nled to renown as an educator and raconteur. His perceptions were influential in\na wide range of other scientific fields, including weak interactions, gravity,\nsuperconductivity, biology, nanotechnology, algorithmic computation and quantum\ncomputers. In all of this, he held to the idea that nature has an intrinsic\nsimplicity and beauty that permit us to find things out, if only we will try\nhard enough."}
{"arxiv_id": "2311.15882v1", "published": "2023-11-27T14:52:29Z", "title": "Droplet control based on pinning and substrate wettability", "summary": "Pinning of liquid droplets on solid substrates is ubiquitous and plays an\nessential role in many applications, especially in various areas, such as\nmicrofluidics and biology. Although pinning can often reduce the efficiency of\nvarious applications, a deeper understanding of this phenomenon can actually\noffer possibilities for technological exploitation. Here, by means of molecular\ndynamics simulation, we identify the conditions that lead to droplet pinning or\ndepinning and discuss the effects of key parameters in detail, such as the\nheight of the physical pinning-barrier and the wettability of the substrates.\nMoreover, we describe the mechanism of the barrier crossing by the droplet upon\ndepinning, identify the driving force of this process, and, also, elucidate the\ndynamics of the droplet. Not only does our work provide a detailed description\nof the pinning and depinning processes, but it also explicitly highlights how\nboth processes can be exploited in nanotechnology applications to control\ndroplet motion. Hence, we anticipate that our study will have significant\nimplications for the nanoscale design of substrates in micro and nano-scale\nsystems and will assist with assessing pinning effects in various applications."}
{"arxiv_id": "2311.10660v1", "published": "2023-11-17T17:25:38Z", "title": "Laser-Based Fabrication of Microstructures on Nickel Thin Films and Its\n  Applications in On-Chip Thin Film Inductors", "summary": "This work reports on the fabrication of microbump structures on Ni films by\nsingle-pulse, localized laser irradiation. Conditions for the reproducible\nformation of such microstructures have been identified in terms of\nlaser-irradiation and film parameters after systematic studies involving a\nrelevant parameter space. The cracks and voids morphology of the sputtered\nfilms was rendered undesirable and hence, smoother Ni thin film of same\nthickness (200nm) were deposited by vacuum evaporation. The continuous nature\nof the film resulted in radially symmetric thermal expansion and deformation,\nthus achieving a high yield of microstructures. An improvement in the\ninductance and the quality factor of on-chip spiral inductors incorporating\nsuch laser-microstructured ferromagnetic nickel thin films was observed, which\ndemonstrates the potential of such a laser-based method for fabrication or fine\ntuning of various micro-/nanoelectric/electronic sensor and other components\nand systems."}
{"arxiv_id": "2311.07447v1", "published": "2023-11-13T16:26:28Z", "title": "Experimental Investigation of nanofluid heat transfer in a square\n  cross-sectional duct", "summary": "English version Forced convective heat transfer of two different nanofluids\nincluding AL$_2$O$_3$-water and CuO-water in laminar flow through square cross\nsection duct under constant heat flux has been investigated. The Nusselt number\nand average convective heat transfer coefficient for different nanoparticles\nconcentrations as a function of Peclet number have been analyzed.\nAL$_2$O$_3$-water nanofluid with 0.2, 0.5, 1.0, 1.5, 2.0 and 2.5 percent volume\nfractions has been tested. The maximum enhancement of convective heat transfer\ncoefficient for each of the above mentioned concentrations was 7, 10, 13, 18,\n22, 27 percent, respectively. Also, CuO-water nanofluid was tested at 0.1, 0.2,\n0.5, 0.8, 1.0 and 1.5 percent volume fractions and the results show that the\nmaximum enhancement of convective heat transfer coefficient for each\nconcentration was 8, 10, 14, 16, 19, 21 percent, respectively."}
{"arxiv_id": "2311.00700v1", "published": "2023-11-01T17:58:47Z", "title": "Annealing effects on the magnetic and magnetotransport properties of\n  iron oxide nanoparticles self-assemblies", "summary": "In magnetic tunnel junctions based on iron oxide nanoparticles the disorder\nand the oxidation state of the surface spin as well as the nanoparticles\nfunctionalization play a crucial role in the magnetotransport properties. In\nthis work, we report a systematic study of the effects of vacuum annealing on\nthe structural, magnetic and transport properties of self-assembled ~10 nm\nFe3O4 nanoparticles. The high temperature treatment (from 573 to 873 K)\ndecomposes the organic coating into amorphous carbon, reducing the electrical\nresistivity of the assemblies by 4 orders of magnitude. At the same time, the\n3Fe2+/(Fe3++Fe2+) ratio is reduced from 1.11 to 0.13 when the annealing\ntemperature of the sample increases from 573 to 873 K, indicating an important\nsurface oxidation. Although the 2 nm physical gap remains unchanged with the\nthermal treatment, a monotonous decrease of tunnel barrier width was obtained\nfrom the electron transport measurements when the annealing temperature\nincreases, indicating an increment in the number of defects and hot-spots in\nthe gap between the nanoparticles. This is reflected in the reduction of the\nspin dependent tunneling, which reduces the interparticle magnetoresistance.\nThis work shows new insights about influence of the nanoparticle interfacial\ncomposition, as well their the spatial arrangement, on the tunnel transport of\nself-assemblies, and evidence the importance of optimizing the nanostructure\nfabrication for increasing the tunneling current without degrading the spin\npolarized current."}
{"arxiv_id": "2311.00667v1", "published": "2023-11-01T17:14:52Z", "title": "Development and application of SEM/EDS in biological, biomedical &\n  nanotechnological research", "summary": "This comprehensive review discusses the development of scanning electron\nmicroscopy and the application of this technology in different fields such as\nbiology, nanobiotechnology and biomedical science. Besides being a tool for\nhigh resolution imaging of surface or topography, the technology is coupled\nwith analytical techniques such as energy dispersive spectroscopy for elemental\nmapping. Since the commercialization of the technology, it has developed\nmanifold and currently very high-resolution nano scale imaging is possible by\nthis technology. The development of FIB-SEM has allowed three-dimensional\nimaging of materials while the development of cryostage allows imaging of\nhydrated biological samples. Though variable pressure or environmental SEM can\nbe used for imaging hydrated samples, they cannot capture a high-resolution\nimage. SBEM and ATUM-SEM has automated the sampling process while improved and\nmore powerful software along with user-friendly computer interface has made\nimage analysis faster and more reliable. This review presents one of the most\nwidely used analytical techniques used across the globe for scientific\ninvestigation. The power and potential of SEM is expanding with the development\nof accessory technology."}
{"arxiv_id": "2311.00139v1", "published": "2023-10-31T20:25:23Z", "title": "Non-destructive tomographic nanoscale imaging of ferroelectric domain\n  walls", "summary": "Extraordinary physical properties arise at polar interfaces in oxide\nmaterials, including the emergence of two-dimensional electron gases,\nsheet-superconductivity, and multiferroicity. A special type of polar interface\nare ferroelectric domain walls, where electronic reconstruction phenomena can\nbe driven by bound charges. Great progress has been achieved in the\ncharacterization of such domain walls and, over the last decade, their\npotential for next-generation nanotechnology has become clear. Established\ntomography techniques, however, are either destructive or offer insufficient\nspatial resolution, creating a pressing demand for 3D imaging compatible with\nfuture fabrication processes. Here, we demonstrate non-destructive tomographic\nimaging of ferroelectric domain walls using secondary electrons. Utilizing\nconventional scanning electron microscopy (SEM), we reconstruct the position,\norientation, and charge state of hidden domain walls at distances up to several\nhundreds of nanometers away from the surface. A mathematical model is derived\nthat links the SEM intensity variations at the surface to the local domain wall\nproperties, enabling non-destructive tomography with good noise tolerance on\nthe timescale of seconds. Our SEM-based approach facilitates high-throughput\nscreening of materials with functional domain walls and domain-wall-based\ndevices, which is essential for monitoring during the production of device\narchitectures and quality control in real-time."}
{"arxiv_id": "2310.14625v1", "published": "2023-10-23T06:57:53Z", "title": "Topological electronic states in holey graphyne", "summary": "We unveil that the holey graphyne (HGY), a two-dimensional carbon allotrope\nwhere benzene rings are connected by two $-$C$\\equiv$C$-$ bonds fabricated\nrecently in a bottom-up way, exhibits topological electronic states. Using\nfirst-principles calculations and Wannier tight-binding modeling, we discover a\nhigher-order topological invariant associated with $C_2$ symmetry of the\nmaterial, and show that the resultant corner modes appear in nanoflakes\nmatching to the structure of precursor reported previously, which are ready for\ndirect experimental observations. In addition, we find that a band inversion\nbetween emergent $g$-like and $h$-like orbitals gives rise to a nontrivial\ntopology characterized by $\\mathbb{Z}_2$ invariant protected by an energy gap\nas large as 0.52 eV, manifesting helical edge states mimicking those in the\nprominent quantum spin Hall effect, which can be accessed experimentally after\nhydrogenation in HGY. We hope these findings trigger interests towards\nexploring the topological electronic states in HGY and related future\nelectronics applications."}
{"arxiv_id": "2310.14401v1", "published": "2023-10-22T20:23:59Z", "title": "Analysis and Calibration of Electron-Dispersive Spectroscope and\n  Scanning Electron Microscope Parameters to Improve their Results", "summary": "The Scanning electron microscope (SEM) and Electron-Dispersive Spectroscope\n(EDS) are two highly effective instruments in the field of nanoscience and\nnanotechnology. The quality of these instruments is determined by various\nfactors, with high resolution being a crucial one. To determine the practically\nachievable resolution of the SEM, reference materials such as gold particles on\ncarbon substrate are commonly utilized. On the other hand, high demanding, and\nusual materials such as brass, aluminum oxide or MEMs are of high importance to\nbe considered in the way of improving material characterization. In this study\nfive different samples were analyzed in four steps to see the effect of\nastigmatism and aperture misalignment, the mirror effect on the charged\nuncoated sample in backscattered electron (BSE) and secondary electron (SE)\nimages, compositional and topographical analysis using both qualitative and\nquantitative methods and finally apply all the steps on a\nmicro-electromechanical system (MEMS) device. This study illustrates the\npossibility of controlling the mirror effect by adjusting the input parameters\neven in the cases that the user needs to have low accelerating voltage for the\nexperiment. Besides, the discussion addresses possible reasons for the absence\nof some peaks in EDS analysis for some specific elements."}
{"arxiv_id": "2310.13919v1", "published": "2023-10-21T06:27:39Z", "title": "Optimized Absorption of Light in Perovskite Nanowire Solar Cells", "summary": "Metal halide perovskite nanowires (PrvNWs) have recently emerged as an\ninteresting path for nanostructured solar cells. Here, we model the absorption\nof light in PrvNW arrays for varying diameter and length of the PrvNWs and\nperiod for the array by solving the Maxwell equations. For long enough bare\nPrvNW arrays, we find that the optimum diameter is fixed to that which places\nthe absorption peak from the HE$_{11}$ waveguide mode in the PrvNWs to the\nvicinity of the bandgap wavelength. In contrast, when we include a transparent\nconductive oxide (TCO) top contact layer, the optimum diameter shifts to a\nlarger value by 100 nm. The origin of this shift is traced to a reduced\nreflection at the interface between the TCO layer and the PrvNW array when the\nPrvNW's diameter is larger. Overall, we find that 1500 nm long PrvNWs can reach\n90% of the broadband absorption potential, making this system of high interest\nfor photovoltaics."}
{"arxiv_id": "2310.10995v1", "published": "2023-10-17T04:49:48Z", "title": "Inverse design of a pyrochlore lattice of DNA origami through\n  model-driven experiments", "summary": "Sophisticated statistical mechanics approaches and human intuition have\ndemonstrated the possibility to self-assemble complex lattices or finite size\nconstructs, but have mostly only been successful in silico. The proposed\nstrategies quite often fail in experiment due to unpredicted traps associated\nto kinetic slowing down (gelation, glass transition), as well as to competing\nordered structures. An additional challenge that theoretical predictions face\nis the difficulty to encode the desired inter-particle interaction potential\nwith the currently available library of nano- and micron-sized particles. To\novercome these issues, we conjugate here SAT-assembly -- a patchy-particle\ninteraction design algorithm based on constrained optimization solvers -- with\ncoarse-grained simulations of DNA nanotechnology to experimentally realize\ntrap-free self-assembly pathways. As a proof of concept we investigate the\nassembly of the pyrochlore (also known as tetrastack) lattice, a highly coveted\n3D crystal lattice due to its promise in construction of optical metamaterials.\nWe confirm the successful assembly with two different patchy DNA origami\ndesigns via SAXS as well as SEM visualization of the silica-coated lattice. Our\napproach offers a versatile modeling pipeline that starts from patchy particles\ndesigned in silico and ends with wireframe DNA origami that self-assemble into\nthe desired structure."}
{"arxiv_id": "2310.10954v1", "published": "2023-10-17T02:59:45Z", "title": "Design of a fault free Inverter Circuit using Minimum number of cells &\n  related Kink Energy Calculation in Quantum dot Cellular Automata", "summary": "Quantum dot Cellular Automata (QCA) is the most promising nanotechnology in\nthe field of microelectronics and VLSI systems. QCA-based circuits require less\npower with a high switching speed of operation compared to CMOS technology. QCA\ninverter is one of the basic building blocks of QCA circuit design. The\nconventional QCA inverter design requires many cells. In this paper, we design\nthe QCA inverter circuit using a lesser number of cells. We showed the kink\nenergy calculation for the QCA-implemented inverters as well as the\npolarization of the circuits."}
{"arxiv_id": "2310.09734v1", "published": "2023-10-15T04:49:33Z", "title": "Behaviors of QCA Inverter due to Cell Displacement and Temperature\n  Variation", "summary": "Quantum dot Cellular Automata (QCA) is the emerging area in the field of\nnanotechnology. Inverter is a fundamental logic primitive in QCA. Molecular,\nsemiconductor, magnetic, and metallic QCA are main methodology in the\nfabrication of quantum cell. While all types of QCA work on room temperature,\nmetallic one is not suitable in normal temperature. So temperature plays a\nsignificant role in QCA circuit. In this paper, the effect of temperature in\ntwo-cell conventional inverter and recently proposed three-cell high polarized\ninverter has been discussed. The polarization and Kink energy of QCA circuit is\ninfluenced due to the change of distance between two cells. This paper clearly\nmentioned the variation of polarization and kink energy of QCA inverter due to\ncell displacement. Finally this paper makes a comparison between the\nconventional two-cell inverter and recently proposed three-cell inverter. The\nsimulation tool QCADesigner has been used to study the effects of QCA"}
{"arxiv_id": "2310.09475v1", "published": "2023-10-14T02:56:10Z", "title": "Twisted DNA origami-based chiral monolayers for spin filtering", "summary": "DNA monolayers with inherent chirality play a pivotal role across various\ndomains, including biosensors, DNA chips, and bioelectronics. Nonetheless,\nconventional DNA chiral monolayers, typically constructed from single-stranded\nDNA (ssDNA) or double-stranded DNA (dsDNA), often lack structural orderliness\nand design flexibility at the interface. Structural DNA nanotechnology emerges\nas a promising solution to tackle these challenges. In this study, we present a\nstrategy for crafting highly adaptable twisted DNA origami-based chiral\nmonolayers. These structures exhibit distinct interfacial assembly\ncharacteristics and effectively mitigate the structural disorder of dsDNA\nmonolayers, which is constrained by a limited persistence length of ~50 nm of\ndsDNA. We highlight the spin-filtering capabilities of four representative DNA\norigami-based chiral monolayers, demonstrating a maximal one-order-of-magnitude\nincrease in spin-filtering efficiency per unit area compared to conventional\ndsDNA chiral monolayers. Intriguingly, our findings reveal that the\nhigher-order, tertiary, chiral structure of twisted DNA origami further\nenhances the spin-filtering efficiency. This work paves the way for the\nrational design of DNA chiral monolayers."}
{"arxiv_id": "2310.05800v1", "published": "2023-10-09T15:36:41Z", "title": "A review on multiscale computational studies for enhanced oil recovery\n  using nanoparticles", "summary": "Oil reservoirs around the globe are at their declining phase and in spite of\nenormous effectiveness of Enhanced Oil Recovery(EOR) in the Tertiary Stage.\nThis process still bypasses some oil reason being surface forces responsible\nfor holding oil inside the rock surface which are not being altered by the\napplication of existing technologies. The processes coming under Tertiary\nSection Supplements primary and secondary sections. However, the mechanism of\noperating is different in both. Nanoparticles are showing a significant role in\nEOR techniques and is a promising approach to increase crude oil extraction.\nThis is due to the fact that size of nanoparticles used for EOR lies in the\nrange of 1-100 nm. It is also an interesting fact that in different operational\nconditions and parameters, the performance of nanoparticles also vary and some\nare more effective than others, which leads to various levels of recovery in\nthe EOR process. In the present study, we intend to summarize a report having\nan up to date status on nanotechnology assisted EOR mechanisms where\nnanoparticles are used as nano-catalysts, nano-emulsions and nanoparticles\nassisted EOR mechanisms to destabilize the oil layer on carbonate surface. This\nreview also highlights the various mechanisms such Gibb's free energy,\nwettability alteration, and Interfacial Tension Reduction (ITR) including\ninteraction of available nanoparticles with reservoirs. Experimental\nmeasurements for a wide range of nanoparticles are not only expensive but are\nchallenging because of the relatively small size, especially for the\nmeasurements of thinner capillaries of a nanoscale diameter. Therefore, we\nconsidered computational simulations as a more adequate approach to gain more\nmicroscopic insights into the oil displacement process to classify the\nsuitability of nanomaterials."}
{"arxiv_id": "2310.03907v1", "published": "2023-10-05T21:25:17Z", "title": "Density-functional perturbation theory for one-dimensional systems:\n  implementation and relevance for phonons and electron-phonon interactions", "summary": "The electronic and vibrational properties and electron-phonon couplings of\none-dimensional materials will be key to many prospective applications in\nnanotechnology. Dimensionality strongly affects these properties and has to be\ncorrectly accounted for in first-principles calculations. Here we develop and\nimplement a formulation of density-functional and density-functional\nperturbation theory that is tailored for one-dimensional systems. A key\ningredient is the inclusion of a Coulomb cutoff, a reciprocal-space technique\ndesigned to correct for the spurious interactions between periodic images in\nperiodic-boundary conditions. This restores the proper one-dimensional\nopen-boundary conditions, letting the true response of the isolated\none-dimensional system emerge. In addition to total energies, forces and stress\ntensors, phonons and electron-phonon interactions are also properly accounted\nfor. We demonstrate the relevance of the present method on a portfolio of\nrealistic systems: BN atomic chains, BN armchair nanotubes, and GaAs nanowires.\nNotably, we highlight the critical role of the Coulomb cutoff by studying\npreviously inaccessible polar-optical phonons and Frohlich electron-phonon\ncouplings. We also develop and apply analytical models to support the physical\ninsights derived from the calculations and we discuss their consequences on\nelectronic lifetimes. The present work unlocks the possibility to accurately\nsimulate the linear response properties of one-dimensional systems, sheds light\non the transition between dimensionalities and paves the way for further\nstudies in several fields, including charge transport, optical coupling and\npolaritronics."}
{"arxiv_id": "2310.01268v1", "published": "2023-10-02T15:12:40Z", "title": "Resistless EUV lithography: photon-induced oxide patterning on silicon", "summary": "In this work, we show the feasibility of extreme ultraviolet (EUV) patterning\non an HF-treated Si(100) surface in the absence of a photoresist. EUV\nlithography is the leading lithography technique in semiconductor manufacturing\ndue to its high resolution and throughput, but future progress in resolution\ncan be hampered because of the inherent limitations of the resists. We show\nthat EUV photons can induce surface reactions on a partially H-terminated Si\nsurface and assist the growth of an oxide layer, which serves as an etch mask.\nThis mechanism is different from the H-desorption in scanning tunneling\nmicroscopy-based lithography. We achieve SiO2/Si gratings with 75 nm half-pitch\nand 31 nm height, demonstrating the efficacy of the method and the feasibility\nof patterning with EUV lithography without the use of a photoresist. Further\ndevelopment of the resistless EUV lithography method can be a viable approach\nto nm-scale lithography by overcoming the inherent resolution and roughness\nlimitations of photoresist materials."}
{"arxiv_id": "2403.15158v1", "published": "2024-03-22T12:13:44Z", "title": "Magnetic Bianchi-I cosmology in the Horndeski theory", "summary": "We study the evolution of Bianchi-I space-times within the framework of the\nHorndeski theory with $G_5=\\text{const}/X$. The space-times are filled a global\nunidirectional electromagnetic field interacting with a scalar field. We\nconsider the minimal interaction and the non-minimal interaction by the law\n$f^2(\\phi)F_{\\mu\\nu}F^{\\mu\\nu}$. The Horndeski theory allows anisotropy to grow\nover time, so the question arises of regulating the anisotropic level in this\ntheory. Using the reconstruction method, we build models in which the\nanisotropic level tends to a small value as the Universe expands. One of the\nresults is a model with a anisotropic bounce."}
{"arxiv_id": "2403.15071v1", "published": "2024-03-22T09:50:55Z", "title": "Gauge invariant variational formulations of electromagnetic gyrokinetic\n  theory", "summary": "The use of gyrokinetics, wherein phase-space coordinate transformations\nresult in a phase-space dimensionality reduction as well as removal of fast\ntime scales, has enabled the simulation of microturbulence in fusion devices.\nThe state-of-the-art gyrokinetic models used in practice are parallel-only\nmodels wherein the perpendicular part of the vector potential is neglected.\nSuch models are inherently not gauge invariant. We generalize the work of\n[Burby, Brizard. Physics Letters A, 383(18):2172-2175] by deriving a sufficient\ncondition on the gyrocentre coordinate transformation which ensures gauge\ninvariance. This leads to a parametrized family of gyrokinetic models for which\nwe motivate a specific choice of parameters that results in a physically\nmeaningful gauge invariant model. Due to gauge invariance this model can be\nexpressed directly in terms of the electromagnetic fields, rather than the\npotentials, and the gyrokinetic model thereby results in the macroscopic\nMaxwell's equations. For the linearized model, it is demonstrated that the\nshear and compressional Alfv\\'en waves are present with the correct\nfrequencies. The fast compressional Alfv\\'en wave can be removed by making use\nof a Darwin-like approximation. This approximation breaks gauge invariance, but\nwe find that the field equations are still compatible without the need of a\nLagrange multiplier."}
{"arxiv_id": "2403.15005v1", "published": "2024-03-22T07:33:53Z", "title": "Coupled circularly polarized electromagnetic soliton states in\n  magnetized plasmas", "summary": "The interaction between two co-propagating electromagnetic pulses in a\nmagnetized plasma is considered, from first principles, relying on a\nfluid-Maxwell model. Two circularly polarized wavepackets by same group\nvelocities are considered, characterized by opposite circular polarization, to\nbe identified as left-hand- or right hand circularly polarized (i.e. LCP or\nRCP, respectively). A multiscale perturbative technique is adopted, leading to\na pair of coupled nonlinear Schrodinger-type (NLS) equations for the modulated\namplitudes of the respective vector potentials associated with the two pulses.\nSystematic analysis reveals the existence, in certain frequency bands, of three\ndifferent types of vector soliton modes: an LCP-bright/RCP-bright coupled\nsoliton pair state, an LCP bright/RCP-dark soliton pair, and an\nLCP-dark/RCP-bright soliton pair. The value of the magnetic field plays a\ncritical role since it determines the type of vector solitons that may occur in\ncertain frequency bands and, on the other hand, it affects the width of those\nfrequency bands that are characterized by a specific type of vector soliton\n(type). The magnetic field (strength) thus arises as an order parameter,\naffecting the existence conditions of each type of solution (in the form of an\nenvelope soliton pair). An exhaustive parametric investigation is presented in\nterms of frequency bands and in a wide range of magnetic field (strength)\nvalues, leading to results that may be applicable in beam-plasma interaction\nscenarios as well as in space plasmas and in the ionosphere."}
{"arxiv_id": "2403.14996v1", "published": "2024-03-22T07:15:43Z", "title": "What we can learn about compact binary mergers from their kilonova\n  signals?", "summary": "Compact binary mergers are sources of gravitational waves, and can be\naccompanied by electromagnetic signals. We discuss the possible features in the\nkilonova emissions which may help distinguish the black hole - neutron star\nmergers from the binary neutron stars. In addition, the amount of ejected\nmaterial may depend on whether the system undergoes the creation of a transient\nhyper-massive, differentially rotating neutron star. In this context, the\nnumerical simulations of post-merger systems and their outflows are important\nfor our understanding of the nature of short GRB progenitor systems. In this\narticle, we present a suite of GR MHD simulations performed by the CTP PAS\nastrophysics group, to model the neutrino driven disk winds and their\ncontribution to the kilonova emissions. The contribution of the disk wind to\nthe jet collimation and variability is also briefly discussed."}
{"arxiv_id": "2403.14846v1", "published": "2024-03-21T21:33:10Z", "title": "Which symmetry group for elementary particles with an electric charge\n  today and in the past?", "summary": "In this paper, we revisit the Kaluza-Klein theory from the perspective of the\nclassification of elementary particles based on the coadjoint orbit method. We\nstudy the momentum map of the corresponding symmetry group $G_1$ which\nconserves the hyperbolic metric. We show that the electric charge is not\nframe-invariant, in contradiction with the experimental observations. In other\nwords, it is not the symmetry group of the Universe today as we know it. To\navert this paradox, we scale the fifth coordinate and consider the limit when\nthe cylinder radius vanishes. For the corresponding group $G_0$, the charge is\ninvariant. On this ground, we propose a cosmological scenario in which the\nelementary particles of the early Universe are classified from the momenta of\nthe group $G_1$, next the three former dimensions inflate quickly while the\nfifth one shrinks, leading to the 4D era in which as today the particles are\ncharacterized by the momenta of the group $G_0$. By this mechanism, the\nelementary particles can acquire electric charge as a by-product of the 4 + 1\nsymmetry breaking of the Universe. This work opens the way to the geometric\nquantization of charged elementary particles. We construct the corresponding\n$G_0$-connections by pullback on the space-time. Imposing that the linear\n5-momentum is parallel-transported, we recover the conservation of the charge\nand the equation of motion with Lorentz force. We revisit the variational\nrelativity and obtain the field equations for both the gravitation and\nelectromagnetic interactions with coupling terms which are negligible at the\nNewtonian approximation, allowing to recover Maxwell equations."}
{"arxiv_id": "2403.14834v1", "published": "2024-03-21T21:08:22Z", "title": "Time and frequency transfers in optical spacetime", "summary": "Solving the null geodesic equations for a ray of light is a difficult task\neven considering a stationary spacetime. The problem becomes even more\ndifficult if the electromagnetic signal propagates through a flowing optical\nmedium. Indeed, because of the interaction between light and matter, the signal\ndoes not follow a null geodesic path of the spacetime metric anymore. However,\nhaving a clear description of how the time and frequency transfers are affected\nin this very situation is of a prime importance in astronomy. As a matter of\nfact, ranging to satellites and Moon, very long baseline interferometry, global\nnavigation satellite systems, and radio occultation experiments are few\nexamples of techniques involving light propagation in flowing optical media. By\napplying the time transfer functions formalism to optical spacetime, we show\nthat the time and frequency transfers can be determined iteratively up to any\ndesired order within the quasi-Minkowskian path approximation. We present some\napplications in the context of radio occultation experiments and discuss\npossible future applications to the modeling of tropospheric delays."}
{"arxiv_id": "2403.14744v1", "published": "2024-03-21T18:00:00Z", "title": "A Comparative Study of TESS Light Curve Extraction Methods Applied to\n  Blazars", "summary": "Blazars are characterized by largely aperiodic variability on timescales\nranging from minutes to decades across the electromagnetic spectrum. The TESS\n(Transiting Exoplanet Survey Satellite) mission provides continuous sampling of\nblazar variability on timescales ranging from tens of minutes to 27 days for a\nsingle sector observation. Proper removal of the background, thermal ramping,\nand onboard systematic effects are crucial to the extraction of a reliable\nblazar light curve. Multiple publicly available procedures have been created to\ncorrect for these effects. Using ground based observations from the Zwicky\nTransit Facility (ZTF) and the Asteroid Terrestrial-impact Last Alert System\n(ATLAS) as ``ground truth'' observations, we compare 6 different methods\n(Regression, Cotrending Basis Vectors (CBV), Pixel Level Decorrelation (PLD),\neleanor, quaver, and simple differential photometry (SDP)) to each other, and\nto our ``ground truth'' observations, to identify which methods properly\ncorrect light curves of a sample of 11 bright blazars, including the suspected\nneutrino source TXS~0506+056. In addition to comparing the resulting light\ncurves, we compare the slopes of the power spectral densities, perform\nleast-square fitting to simultaneous ZTF data, and quantify other statistical\nqualities generated from the light curves of each method. We find that only\nthree of the six methods compared (Simple Differential Photometry, eleanor, and\nquaver) produce TESS light curves consistent with the ground-based ZTF and\nATLAS observations."}
{"arxiv_id": "2403.14612v1", "published": "2024-03-21T17:58:03Z", "title": "Observing the Galactic Underworld: Predicting photometry and astrometry\n  from compact remnant microlensing events", "summary": "Isolated black holes (BHs) and neutron stars (NSs) are largely undetectable\nacross the electromagnetic spectrum. For this reason, our only real prospect of\nobserving these isolated compact remnants is via microlensing; a feat recently\nperformed for the first time. However, characterisation of the microlensing\nevents caused by BHs and NSs is still in its infancy. In this work, we perform\nN-body simulations to explore the frequency and physical characteristics of\nmicrolensing events across the entire sky. Our simulations find that every year\nwe can expect $88_{-6}^{+6}$ BH, $6.8_{-1.6}^{+1.7}$ NS and $20^{+30}_{-20}$\nstellar microlensing events which cause an astrometric shift larger than 2~mas.\nSimilarly, we can expect $21_{-3}^{+3}$ BH, $18_{-3}^{+3}$ NS and\n$7500_{-500}^{+500}$ stellar microlensing events which cause a bump magnitude\nlarger than 1~mag. Leveraging a more comprehensive dynamical model than prior\nwork, we predict the fraction of microlensing events caused by BHs as a\nfunction of Einstein time to be smaller than previously thought. Comparison of\nour microlensing simulations to events from in Gaia finds good agreement.\nFinally, we predict that in the combination of Gaia and GaiaNIR data there will\nbe $14700_{-900}^{+600}$ BH and $1600_{-200}^{+300}$ NS events creating a\ncentroid shift larger than 1~mas and $330_{-120}^{+100}$ BH and\n$310_{-100}^{+110}$ NS events causing bump magnitudes $< -1$. Of these, $<10$\nBH and $5_{-5}^{+10}$ NS events should be detectable using current analysis\ntechniques. These results inform future astrometric mission design, such as\nGaiaNIR, as they indicate that, compared to stellar events, there are fewer\nobservable BH events than previously thought."}
{"arxiv_id": "2403.14245v1", "published": "2024-03-21T09:04:16Z", "title": "Hopfion-like solutions in de Sitter spacetime", "summary": "We construct electromagnetic field with non-trivial topological properties on\nde Sitter background. The field is closely related with Hopf fibration. We\nanalyze energy, angular momentum and topological charges for this solution. The\npaper is a generalization of CQG \\textbf{35} (2018), no. 24, 245010 to de\nSitter spacetime."}
{"arxiv_id": "2403.14730v1", "published": "2024-03-21T03:12:21Z", "title": "Topology of dyonic AdS black holes with quasitopological\n  electromagnetism in Einstein-Gauss-Bonnet gravity", "summary": "In this study, we employ the thermodynamic topological method to classify\ncritical points for the dyonic AdS black holes with QTE in the EGB background.\nTo this end, we find that there is a small/large BH phase transition in any\nspace-time dimension, a conventional critical point exists with the total\ntopological charge of $Q_t=-1$. The existence of the coupling constant $\\alpha$\ngives rise to a more intricate phase structure of the black hole, with the\nemergence of a triple points requires $\\alpha\\geq0.5$ and $d=6$. Interestingly,\nthe condition for the simultaneous occurrence of small/intermediate and\nintermediate/large phase transition is that the coupling constant a takes a\nspecial value ($\\alpha=0.5$), the two conventional critical points\n$(CP_{1},CP_{2})$ of the black hole are (physical) critical point, and the\nnovel critical point that lacks the capability to minimize the Gibbs free\nenergy. The critical point ($Q_{CP_1}=Q_{CP_2}=-1$) is observed to occur at the\nmaximum extreme points of temperature in the isobaric curve, while the critical\npoint $(Q_{CP_3}=1)$, emerges at the minimum extreme points of temperature.\nFurthermore, the number of phases at the novel critical point exhibits an\nupward trend, followed by a subsequent decline at the conventional critical\npoints. With the increase of the coupling constant $(\\alpha = 1 )$, although\nthe system has three critical points, only $CP_{1}$ is a (physical) critical\npoint, and the $CP_{2}$ serves as the phase annihilation point. This means that\nthe coupling constant $\\alpha$ has a non-negligible effect on the phase\nstructure of the black hole."}
{"arxiv_id": "2403.13981v1", "published": "2024-03-20T21:22:52Z", "title": "Electricity at the macroscale and its microscopic origins", "summary": "I define the fields that describe electrical macrostructure, and their rates\nof change, in terms of the microscopic charge density, electric field, electric\npotential, and their rates of change. To deduce these definitions, I lay some\nfoundations of a general theory of structure homogenization, meaning a theory\nof how any observable macroscopic field is related to spatial averages of its\nmicroscopic counterpart.\n  I apply homogenization theory to the fields that appear in the vacuum theory\nof electromagnetism and deduce that the relationships between macroscopic\nfields are identical in form to the relationships between their microscopic\ncounterparts. Without invoking quantum mechanics, I derive the expressions for\npolarization current established by the Modern Theory of Polarization. I prove\nthat the bulk-average electric potential, or mean inner potential, vanishes in\na macroscopically-uniform charge-neutral material, and I show that when a\ncrystal lattice lacks inversion symmetry, it does not imply the existence of\nmacroscopic $\\vec{E}$ or $\\vec{P}$ fields in the crystal's bulk.\n  I point out that symmetry is scale-dependent. Therefore, if anisotropy of the\nmicrostructure does not manifest as anisotropy of the macrostructure, it cannot\nbe the origin of a macroscopic vector field. The macroscopic charge density is\nisotropic in the bulks of most materials, because it vanishes at every point.\nTherefore, regardless of the microstructure, a macroscopic electric field\ncannot emanate from the bulk. I find that all relationships between observable\nmacroscopic fields can be expressed mathematically without introducing the\npolarization ($\\vec{P}$) and electric displacement ($\\vec{D}$) fields, neither\nof which is observable.\n  ~"}
{"arxiv_id": "2403.13880v1", "published": "2024-03-20T18:00:02Z", "title": "Topological Dipole Insulator", "summary": "We expand the concept of two-dimensional topological insulators to encompass\na novel category known as topological dipole insulators (TDIs), characterized\nby conserved dipole moments along the $x$-direction in addition to charge\nconservation. By generalizing Laughlin's flux insertion argument, we prove a\nno-go theorem and predict possible edge patterns and anomalies in a TDI with\nboth charge $U^e(1)$ and dipole $U^d(1)$ symmetries. The edge of a TDI is\ncharacterized as a quadrupolar channel that displays a dipole $U^d(1)$ anomaly.\nA quantized amount of dipole gets transferred between the edges under the\ndipolar flux insertion, manifesting as `quantized quadrupolar Hall effect' in\nTDIs. A microscopic coupled-wire Hamiltonian realizing the TDI is constructed\nby introducing a mutually commuting pair-hopping terms between wires to gap out\nall the bulk modes while preserving the dipole moment. The effective action at\nthe quadrupolar edge can be derived from the wire model, with the corresponding\nbulk dipolar Chern-Simons response theory delineating the topological\nelectromagnetic response in TDIs. Finally, we enrich our exploration of\ntopological dipole insulators to the spinful case and construct a dipolar\nversion of the quantum spin Hall effect, whose boundary evidences a mixed\nanomaly between spin and dipole symmetry. Effective bulk and the edge action\nfor the dipolar quantum spin Hall insulator are constructed as well."}
{"arxiv_id": "2403.13753v1", "published": "2024-03-20T17:01:30Z", "title": "Generation and effects of primordial magnetic fields during inflation", "summary": "In this thesis, we aim to investigate the mechanisms underlying the genesis\nof magnetic fields in the Universe and explore their potential in addressing\nthe matter-antimatter asymmetry. We construct consistent models that generate\nthe helical magnetic field consistent with observations. We also develop an\neffective field theory approach to magnetogenesis, where the choice of EFT\nparameters describes the magnetogenesis scenario in the early Universe, and\ndifferent choices of parameters correspond to different models. Our EFT\nexplicitly shows that generating primordial magnetic fields requires two\nnecessary conditions: conformal invariance breaking and causal propagation.\nFurthermore, we establish that the presence of a strong magnetic field near\ncompact objects, such as neutron stars, aids in understanding the phenomenon of\nFast radio bursts through the conversion of gravitational waves to\nelectromagnetic waves in the background of a strong transverse magnetic field."}
{"arxiv_id": "2403.13669v1", "published": "2024-03-20T15:27:38Z", "title": "Ultraclean Andreev interferometers", "summary": "Coupling a two-terminal Josephson junction to the stationary modes of the\nelectromagnetic field produces the so-called Fiske resonances. Here, we propose\nanother mechanism based on the exchange between the static Andreev bound states\n(ABS) and a nonequilibrium Fermi surface in an ultraclean multiterminal device.\nAs a simple model, we consider an effective $S_a$-$N_{eff}$-$S_b$ double\njunction connecting the superconductors $S_a$ and $S_b$ to the infinite central\nnormal metal $N_{eff}$. We find that the underlying microscopic process of\nphase-sensitive Andreev reflection (phase-AR) produces the possibility of an\ninversion, that is, the conductance can be larger at half-flux quantum than in\nzero field. The inversion-noninversion alternate as the bias voltage is\nincreased. In addition, if the central region $N_{eff}$ is an integrable\nbilliard connected to an infinite normal reservoir, we find that the standard\nABS are replaced by one- and two-particle Andreev resonances that can be probed\nby the bias voltage. Finally, we find that, in the corresponding\nall-superconducting Andreev interferometer, the superconducting gap produces\nprotection against the short relaxation time of the quasiparticle continua if\nthe time periodic dynamics is treated as a perturbation. The spectrum of the\ntwo-particle resonances is then sparse inside the spectrum of the pairs of\none-particle resonances. Our work supports the nonFloquet intrinsic resonances\nin two-dimensional metal-based Andreev interferometers, and challenges the\nFloquet theory of multiterminal Josephson junctions."}
{"arxiv_id": "2403.13622v1", "published": "2024-03-20T14:15:18Z", "title": "Nonlocality of the energy density of a spontaneously emitted\n  single-photon from a Hydrogen atom", "summary": "We analyze through the expectation value of the energy density the spatial\nnonlocality of single photons emitted by the spontaneous decay of a Hydrogen\natom. By using a minimal coupling between the quantized electromagnetic field\nand the atom, we compute the state of the photon under the assumption that only\na single-photon is produced. The calculations are thus performed in the\nsubspace of single-photon states which is essentially equivalent to the\nrotating wave approximation. We obtain a characterization of the spatial decay\nof the energy density. We compute the asymptotic limit of large distances from\nthe atom at each given time, and find an algebraic behavior of $1/r^6$. This\nresult confirms that the energy density of single-photon states is nonlocal and\nthe algebraic decay is far from the maximal quasiexponential localization\npredicted by the theory."}
{"arxiv_id": "2403.13532v1", "published": "2024-03-20T12:03:53Z", "title": "Unveiling the composition of the single-charm molecular pentaquarks:\n  insights from M1 radiative decays and magnetic moments", "summary": "In order to unravel the composition of the isoscalar $DN$, $D^*N$, $D_1N$,\nand $D_2^*N$ molecular pentaquarks, this study systematically investigates\ntheir electromagnetic properties, including the M1 radiative decays and the\nmagnetic moment properties. Using the constituent quark model and taking into\naccount both the $S$-$D$ wave mixing effect and the coupled channel effect, our\nanalysis yields numerical results indicating that the M1 radiative decays and\nthe magnetic moment properties of these molecular pentaquarks provide some\ninsights into their inner structures. These results can serve as crucial clues\nfor distinguishing their spin-parity quantum numbers and configurations in\nexperimental studies. In addition, we highlight the importance of the\nelectromagnetic properties as key observables for elucidating the inner\nstructures of the observed $\\Lambda_c^{+} (2940)$ and $\\Lambda_c^{+} (2910)$.\nWe expect that these discoveries will inspire our experimental colleagues to\nfurther explore the family of the single-charm molecular pentaquarks and to\ninvestigate the inner structures of the $\\Lambda_c^{+} (2940)$ and\n$\\Lambda_c^{+} (2910)$ in future studies."}
{"arxiv_id": "2403.13210v1", "published": "2024-03-20T00:07:30Z", "title": "Modeling RIS from Electromagnetic Principles to Communication\n  Systems--Part II: System-Level Simulation, Ray Tracing, and Measurement", "summary": "In this paper, we systematically study the electromagnetic (EM) and\ncommunication aspects of an RIS through EM simulations, system-level and\nray-tracing simulations, and finally measurements. We simulate a nearly\nperfect, lossless RIS, and a realistic lossy anomalous reflector (AR) in\ndifferent ray tracers and analyze the large-scale fading of simple RIS-assisted\nlinks. We also compare the results with continuous and quantized unit cell\nreflection phases with one to four-bit resolutions. Finally, we perform\nover-the-air communication link measurements in an indoor setting with a\nmanufactured sample of a wide-angle AR. The EM, system-level, and ray-tracing\nsimulation results show good agreement with the measurement results. It is\nproved that the introduced macroscopic model of RIS from the EM aspects is\nconsistent with our proposed communication models, both for an ideal RIS and a\nrealistic AR."}
{"arxiv_id": "2403.13856v1", "published": "2024-03-19T19:46:18Z", "title": "Ray Theory of Waves", "summary": "In order to deal with the interaction of an electromagnetic wave with large\nhomogeneous objects of arbitrary shape with smooth surface we develop the ray\ntheory of waves (RTW) which is composed of the vectorial complex ray model\n(VCRM) and VCRM based singularity theory. By introducing the wavefront\ncurvature as an intrinsic property of rays, VCRM permits to predict the\namplitude and the phase of field at any point rigorously in the sense of ray\nmodel. Its combination with the singularity theory remedies the discontinuity\nin the ray model. In this letter, the wavefront equation, key physical law of\nVCRM describing the relation between the wavefront curvatures of the incident\nwave and the refracted/reflected wave, is derived for the most general case of\nthree dimension scattering. The strategy of the calculation scheme in RTW is\ndescribed. Typical applications to the prediction of the rainbow patterns of a\nspheroidal drop are presented. The comparison to a rigorous numerical method,\nmultilevel fast multipole algorithm, shows that RTW can predict very fast and\nprecisely the scattered field even in the vicinity of caustics."}
{"arxiv_id": "2403.13071v1", "published": "2024-03-19T18:05:56Z", "title": "Strong coupling and single-photon nonlinearity in free-electron quantum\n  optics", "summary": "The observation that free electrons can interact coherently with quantized\nelectromagnetic fields and matter systems has led to a plethora of proposals\nleveraging the unique quantum properties of free electrons. At the heart of\nthese proposals lies the assumption of a strong quantum interaction between a\nflying free electron and a photonic mode. However, existing schemes are\nintrinsically limited by electron diffraction, which puts an upper bound on the\ninteraction length and therefore the quantum coupling strength. Here, we\npropose the use of \"free-electron fibers'': effectively one-dimensional\nphotonic systems where free electrons co-propagate with two guided modes. The\nfirst mode applies a ponderomotive trap to the free electron, effectively\nlifting the limitations due to electron diffraction. The second mode strongly\ncouples to the guided free electron, with an enhanced coupling that is orders\nof magnitude larger than previous designs. Moreover, the extended interaction\nlengths enabled by our scheme allows for strong single-photon nonlinearities\nmediated by free electrons. We predict a few interesting observable quantum\neffects in our system, such as deterministic single-photon emission and\ncomplex, nonlinear multimode dynamics. Our proposal paves the way towards the\nrealization of many anticipated effects in free-electron quantum optics, such\nas non-Gaussian light generation, deterministic single photon emission, and\nquantum gates controlled by free-electron--photon interactions."}
{"arxiv_id": "2403.13053v1", "published": "2024-03-19T18:00:02Z", "title": "Asymptotic Symmetries for Logarithmic Soft Theorems in Gauge Theory and\n  Gravity", "summary": "Gauge theories and perturbative gravity in four dimensions are governed by a\ntower of infinite-dimensional symmetries which arise from tree-level soft\ntheorems. However, aside from the leading soft theorems which are all-loop\nexact, subleading ones receive loop corrections due to long-range infrared\neffects which result in new soft theorems with logarithmic dependence on the\nenergy of the soft particle. The conjectured universality of these logarithmic\nsoft theorems to all loop orders cries out for a symmetry interpretation. In\nthis letter we initiate a program to compute long-range infrared corrections to\nthe charges that generate the asymptotic symmetries in (scalar) QED and\nperturbative gravity. For late-time fall-offs of the electromagnetic and\ngravitational fields which give rise to infrared dressings for the matter\nfields, we derive finite charge conservation laws and show that in the quantum\ntheory they correspond precisely to the first among the infinite tower of\nlogarithmic soft theorems. This symmetry interpretation, by virtue of being\nuniversal and all-loop exact, is a key element for a holographic principle in\nspacetimes with flat asymptotics."}
{"arxiv_id": "2403.12944v1", "published": "2024-03-19T17:48:32Z", "title": "Statistical analysis of IUVB values in Mexico City from 2000 to 2022", "summary": "The solar radiation are electromagnetic waves, composed of infrared, visible\nspectrum and ultraviolet. The infrared component is the cause of thermal\nenergy, the visible spectrum allows to see and the ultraviolet component is the\nmost energetic part and dangerous for the human body (skin and eyes). The\nultraviolet rays are divided in a wavelength range, in three parts; called UVA\n(100-280 nm), UVB (280-315 nm) and UVC (315-400 nm). The UVC are the most\nenergetic (followed by the UVB rays ), however are stopped in the ozone layer.\nIn this work it shown a statistical analysis of the UVB index measured by five\nstation in Mexico City, from the years 2000 to 2022. Through a Gaussian fit\ndistribution, it was found that the range when the IUVB value exceeds the value\nof seven, which is from 11:00 to 16:00, having an average mean value of 13:09\nhrs. $\\pm$ 4 min. i.e. the time at which the UVB index reaches its maximum\nvalue. This occurs in the months from February to October. More than 80% of\nradiation is for UVB values less than 7 and less than the remaining 20% is for\nIUVB values greater than 7. Finally, it was possible to observe that the mean\nvalue per year, reaches its maximum when the solar cycles occurs, which was in\nthe years 2003 and 2013."}
{"arxiv_id": "2403.13854v1", "published": "2024-03-19T15:29:43Z", "title": "On the Occurrence of a Phase Transition in Atomic Systems", "summary": "We present a simple argument confirming the spontaneous quantum condensation\nof an electromagnetic field in matter in the case of a multi-level atomic\nsystem coupled to a single-mode electromagnetic field in the dipole\napproximation. The obtained result disproves the validity of a ``no-go\ntheorem'' and fully rehabilitates theories of spontaneous quantum condensation\nof the electromagnetic field in matter. Peculiar features of the identified\ncoherent states are outlined."}
{"arxiv_id": "2403.12790v1", "published": "2024-03-19T14:52:53Z", "title": "Modeling RIS from Electromagnetic Principles to Communication\n  Systems--Part I: Synthesis and Characterization of a Scalable Anomalous\n  Reflector", "summary": "This work aims to build connections between the electromagnetic and\ncommunication aspects of Reconfigurable Intelligent Surfaces (RIS) by proposing\na methodology to combine outputs from electromagnetic RIS design into an\nRIS-tailored system-level simulator and a ray tracer. In this first part of the\ncontribution, a periodic anomalous reflector is designed using an algebraic\narray antenna scattering synthesis technique that enables electromagnetically\naccurate modeling of scattering surfaces with both static and reconfigurable\nscattering characteristics. The multi-mode periodic structure, capable of\nscattering into several anomalous angles through manipulation of reactive\nloads, is then cropped into finite-sized arrays, and the quantization effects\nof the load reactances on the array scattering are analyzed. An experimental\nanomalous reflector is demonstrated with a comparison between simulated and\nmeasured scattering performance. In the second part, the simulated receiving\nand transmitting scattering patterns of the anomalous reflector are utilized to\nbuild an electromagnetically consistent path loss model of an RIS into a\nsystem-level simulator. Large-scale fading is analyzed in simple scenarios of\nRIS-assisted wireless networks to verify the communication model, and an indoor\nscenario measurement using the manufactured anomalous reflector sample to\nsupport the simulation analysis. After verifying the connections between\nelectromagnetic and communication aspects through simulations and measurements,\nthe proposed communication model can be used for a broad range of RIS designs\nto perform large-scale system-level and ray-tracing simulations in realistic\nscenarios."}
{"arxiv_id": "2403.12697v1", "published": "2024-03-19T12:55:18Z", "title": "Optimal estimate of electromagnetic field concentration between two\n  nearly-touching inclusions in the quasi-static regime", "summary": "We investigate the electromagnetic field concentration between two\nnearly-touching inclusions that possess high-contrast electric permittivities\nin the quasi-static regime. By using layer potential techniques and asymptotic\nanalysis in the low-frequency regime, we derive low-frequency expansions that\nprovide integral representations for the solutions of the Maxwell equations.\nFor the leading-order term $\\bE_0$ of the asymptotic expansion of the electric\nfield, we prove that it has the blow up order of $\\epsilon^{-1} |\\ln\n\\epsilon|^{-1}$ within the radial geometry, where $\\epsilon$ signifies the\nasymptotic distance between the inclusions. By delicate analysis of the\nintegral operators involved, we further prove the boundedness of the\nfirst-order term $\\bE_1$. We also conduct extensive numerical experiments which\nnot only corroborate the theoretical findings but also provide more discoveries\non the field concentration in the general geometric setup. Our study provides\nthe first treatment in the literature on field concentration between\nnearly-touching material inclusions for the full Maxwell system."}
{"arxiv_id": "2403.12656v1", "published": "2024-03-19T11:44:19Z", "title": "ac Hall Effect and Photon Drag of Superconducting Condensate", "summary": "We suggest a theoretical description of the photogalvanic phenomena arising\nin superconducting condensates in the field of electromagnetic wave. The ac\nHall effect and photon drag are shown to originate from the second-order\nnonlinear response of superconducting carriers caused by the suppression of\ntheir concentration due to the combined influence of the electron - hole\nasymmetry and charge imbalance generated by the incident electromagnetic wave.\nStarting from the time-dependent Ginzburg-Landau theory with the complex\nrelaxation constant we develop a phenomenological description of these\nphenomena and investigate the resulting behavior of the dc supercurrent and\nsecond harmonic induced by microwave radiation incident on a superconductor\nsurface."}
{"arxiv_id": "2403.12620v1", "published": "2024-03-19T10:40:18Z", "title": "Near-Field Channel Estimation in Dual-Band XL-MIMO with Side\n  Information-Assisted Compressed Sensing", "summary": "Near-field communication comes to be an indispensable part of the future\nsixth generation (6G) communications at the arrival of the forth-coming\ndeployment of extremely large-scale multiple-input-multiple-output (XL-MIMO)\nsystems. Due to the substantial number of antennas, the electromagnetic\nradiation field is modeled by the spherical waves instead of the conventional\nplanar waves, leading to severe weak sparsity to angular-domain near-field\nchannel. Therefore, the channel estimation reminiscent of the conventional\ncompression sensing (CS) approaches in the angular domain, judiciously utilized\nfor low pilot overhead, may result in unprecedented challenges. To this end,\nthis paper proposes a brand-new near-field channel estimation scheme by\nexploiting the naturally occurring useful side information. Specifically, we\nformulate the dual-band near-field communication model based on the fact that\nhigh-frequency systems are likely to be deployed with lower-frequency systems.\nRepresentative side information, i.e., the structural characteristic\ninformation derived by the sparsity ambiguity and the out-of-band spatial\ninformation stemming from the lower-frequency channel, is explored and tailored\nto materialize exceptional near-field channel estimation. Furthermore, in-depth\ntheoretical analyses are developed to guarantee the minimum estimation error,\nbased on which a suite of algorithms leveraging the elaborating side\ninformation are proposed. Numerical simulations demonstrate that the designed\nalgorithms provide more assured results than the off-the-shelf approaches in\nthe context of the dual-band near-field communications in both on- and off-grid\nscenarios, where the angle of departures/arrivals are discretely or\ncontinuously distributed, respectively."}
{"arxiv_id": "2403.13034v1", "published": "2024-03-19T10:06:54Z", "title": "Study of silicon photomultipliers for the readout of a\n  lead/scintillating-fiber calorimeter", "summary": "The KLOE electromagnetic calorimeter is expected to be reused in the Near\nDetector complex of the DUNE experiment at Fermilab. The possible substitution\nof traditional Photomultiplier Tubes (PMTs) with Silicon Photomultipliers\n(SiPMs) in the refurbished calorimeter is the object of this investigation. A\nblock of the KLOE lead-scintillating fiber calorimeter has been equipped with\nlight guides and external trigger scintillators. The signals induced by cosmic\nrays and environmental radioactivity have been collected by SiPM arrays on one\nside of the calorimeter, and by conventional PMTs on the opposite side.\nEfficiency, stability, and timing resolution of SiPMs have been studied and\ncompared with KLOE-PMTs performance. Conclusions about the convenience of\nsubstituting PMTs with SiPMs are drawn."}
{"arxiv_id": "2403.12506v1", "published": "2024-03-19T07:13:17Z", "title": "Sparse Estimation for XL-MIMO with Unified LoS/NLoS Representation", "summary": "Extremely large-scale antenna array (ELAA) is promising as one of the key\ningredients for the sixth generation (6G) of wireless communications. The\nelectromagnetic propagation of spherical wavefronts introduces an additional\ndistance-dependent dimension beyond conventional beamspace. In this paper, we\nfirst present one concise closed-form channel formulation for extremely\nlarge-scale multiple-input multiple-output (XL-MIMO). All line-of-sight (LoS)\nand non-line-of-sight (NLoS) paths, far-field and near-field scenarios, and\nXL-MIMO and XL-MISO channels are unified under the framework, where additional\nVandermonde windowing matrix is exclusively considered for LoS path. Under this\nframework, we further propose one low-complexity unified LoS/NLoS orthogonal\nmatching pursuit (XL-UOMP) algorithm for XL-MIMO channel estimation. The\nsimulation results demonstrate the superiority of the proposed algorithm on\nboth estimation accuracy and pilot consumption."}
{"arxiv_id": "2403.12498v1", "published": "2024-03-19T07:04:51Z", "title": "WMMSE-Based Rate Maximization for RIS-Assisted MU-MIMO Systems", "summary": "Reconfigurable intelligent surface (RIS) technology, given its ability to\nfavorably modify wireless communication environments, will play a pivotal role\nin the evolution of future communication systems. This paper proposes rate\nmaximization techniques for both single-user and multiuser MIMO systems, based\non the well-known weighted minimum mean square error (WMMSE) criterion. Using a\nsuitable weight matrix, the WMMSE algorithm tackles an equivalent weighted mean\nsquare error (WMSE) minimization problem to achieve the sum-rate maximization.\nBy considering a more practical RIS system model that employs a tensor-based\nrepresentation enforced by the electromagnetic behavior exhibited by the RIS\npanel, we detail both the sum-rate maximizing and WMSE minimizing strategies\nfor RIS phase shift optimization by deriving the closed-form gradient of the\nWMSE and the sum-rate with respect to the RIS phase shift vector. Our\nsimulations reveal that the proposed rate maximization technique, rooted in the\nWMMSE algorithm, exhibits superior performance when compared to other\nbenchmarks."}
{"arxiv_id": "2403.13852v1", "published": "2024-03-19T06:20:43Z", "title": "Earthquakes Three-Stage Early Warning and Short-Term Prediction", "summary": "The article discusses the possibilities of three-step early warning and\nshort-term prediction of earthquakes based on the classical geological model of\nfault formation and a model of the generation of electromagnetic emissions\ndetected before earthquakes. These possibilities are revealed by the analysis\nof frequency data of VLF/LF electromagnetic radiation, existing before the\nearthquake preparation period."}
{"arxiv_id": "2403.12380v1", "published": "2024-03-19T02:46:42Z", "title": "Slowly decaying ringdown of a rapidly spinning black hole II: Inferring\n  the masses and spins of supermassive black holes with LISA", "summary": "Electromagnetic observations reveal that almost all galaxies have\nsupermassive black holes (SMBHs) at their centers, but their properties,\nespecially their spins, are not fully understood. Some of the authors have\nrecently shown [Oshita and Tsuna (2023)] that rapid spins of $>0.9$, inferred\nfor masses around $10^7\\ M_\\odot$ from observations of local SMBHs and\ncosmological simulations, source {\\it long-lived} ringdowns that enhance the\nprecision of black hole spectroscopy to test gravity in the near-extreme Kerr\nspacetime. In this work, we estimate the statistical errors in the SMBH\nmass-spin inference in anticipation of the LISA's detection of extreme\nmass-ratio mergers. We show that for rapidly spinning SMBHs, more precise mass\nand spin measurements are expected due to the excitations of higher angular\nmodes. For a near-extremal SMBH of mass $10^7M_\\odot$ merging with a smaller BH\nwith mass ratio $10^{-3}$ at a luminosity distance of $\\lesssim\n10\\:\\mathrm{Gpc}$ (redshift $z \\lesssim 1.37$), the measurement errors in the\nmass and spin of the SMBH would be $\\sim 1\\:\\mathrm{\\%}$ and $\\sim\n10^{-1}\\:\\mathrm{\\%}$ respectively."}
{"arxiv_id": "2403.12369v1", "published": "2024-03-19T02:28:32Z", "title": "Block-Dominant Compressed Sensing for Near-Field Communications:\n  Fundamentals, Solutions and Future Directions", "summary": "Near-field (NF) communications draw much attention in the context of\nextremely large-scale antenna arrays (ELAA). Owing to a large number of\nantennas and high carrier frequency, the NF coverage distance is quite\nsubstantial, where the electromagnetic radiation propagates by spherical waves,\nin contrast to the conventional planar waves of the far-field. Motivated by\nthese facts, the block-dominant compressed sensing (BD-CS) assisted NF\ncommunications are proposed. Specifically, we elucidate why block sparsity\nexists in the distance-limited NF region. Then, block-dominant side-information\n(BD-SI) is introduced in support of the actual NF communication implementation.\nWe validate that BD-CS is capable of providing exceptional channel estimation\naccuracy and high spectral efficiency, where the associated challenges,\nopportunities and its actual implementation in NF communications need to be\ncarefully addressed."}
{"arxiv_id": "2403.12352v1", "published": "2024-03-19T01:44:02Z", "title": "A New Intelligent Reflecting Surface-Aided Electromagnetic Stealth\n  Strategy", "summary": "Electromagnetic wave absorbing material (EWAM) plays an essential role in\nmanufacturing stealth aircraft, which can achieve the electromagnetic stealth\n(ES) by reducing the strength of the signal reflected back to the radar system.\nHowever, the stealth performance is limited by the coating thickness, incident\nwave angles, and working frequencies. To tackle these limitations, we propose a\nnew intelligent reflecting surface (IRS)-aided ES system where an IRS is\ndeployed at the target to synergize with EWAM for effectively mitigating the\necho signal and thus reducing the radar detection probability. Considering the\nmonotonic relationship between the detection probability and the received\nsignal-to-noise-ratio (SNR) at the radar, we formulate an optimization problem\nthat minimizes the SNR under the reflection constraint of each IRS element, and\na semi-closed-form solution is derived by using Karush-Kuhn-Tucker (KKT)\nconditions. Simulation results validate the superiority of the proposed\nIRS-aided ES system compared to various benchmarks."}
{"arxiv_id": "2403.12289v1", "published": "2024-03-18T22:23:03Z", "title": "BostonTwin: the Boston Digital Twin for Ray-Tracing in 6G Networks", "summary": "Digital twins are now a staple of wireless networks design and evolution.\nCreating an accurate digital copy of a real system offers numerous\nopportunities to study and analyze its performance and issues. It also allows\ndesigning and testing new solutions in a risk-free environment, and applying\nthem back to the real system after validation. A candidate technology that will\nheavily rely on digital twins for design and deployment is 6G, which promises\nrobust and ubiquitous networks for eXtended Reality (XR) and immersive\ncommunications solutions. In this paper, we present BostonTwin, a dataset that\nmerges a high-fidelity 3D model of the city of Boston, MA, with the existing\ngeospatial data on cellular base stations deployments, in a ray-tracing-ready\nformat. Thus, BostonTwin enables not only the instantaneous rendering and\nprogrammatic access to the building models, but it also allows for an accurate\nrepresentation of the electromagnetic propagation environment in the real-world\ncity of Boston. The level of detail and accuracy of this characterization is\ncrucial to designing 6G networks that can support the strict requirements of\nsensitive and high-bandwidth applications, such as XR and immersive\ncommunication."}
{"arxiv_id": "2403.12268v1", "published": "2024-03-18T21:33:19Z", "title": "Near-Field Channel Modeling for Electromagnetic Information Theory", "summary": "Electromagnetic information theory (EIT) is one of the important topics for\n6G communication due to its potential to reveal the performance limit of\nwireless communication systems. For EIT, the research foundation is reasonable\nand accurate channel modeling. Existing channel modeling works for EIT in\nnon-line-of-sight (NLoS) scenario focus on far-field modeling, which can not\naccurately capture the characteristics of the channel in near-field. In this\npaper, we propose the near-field channel model for EIT based on electromagnetic\nscattering theory. We model the channel by using non-stationary Gaussian random\nfields and derive the analytical expression of the correlation function of the\nfields. Furthermore, we analyze the characteristics of the proposed channel\nmodel, e.g., the sparsity of the model in wavenumber domain. Based on the\nsparsity of the model, we design a channel estimation scheme for near-field\nscenario. Numerical analysis verifies the correctness of the proposed scheme\nand shows that it can outperform existing schemes like least square (LS) and\northogonal matching pursuit (OMP)."}
{"arxiv_id": "2403.11930v2", "published": "2024-03-18T16:30:38Z", "title": "Quantitative phase microscopies: accuracy comparison", "summary": "This article presents a thorough comparison of themain QPM techniques,\nfocusing on their accuracy in terms of measurement precision and trueness. We\nfocus on 8 techniques, namely digital holographic microscopy (DHM),\ncross-grating wavefront microscopy (CGM), which is based on QLSI (quadriwave\nlateral shearing interferometry), diffraction phase microscopy (DPM),\ndifferential phase-contrast (DPC) microscopy, phase-shifting interferometry\n(PSI) imaging, Fourier phase microscopy (FPM), spatial light interference\nmicroscopy (SLIM), and transport-of-intensity equation (TIE) imaging. For this\npurpose, we used a home-made numerical toolbox based on discrete dipole\napproximation (IF-DDA). This toolbox is designed to compute the electromagnetic\nfield at the sample plane of a microscope, irrespective of the object's\ncomplexity or the illumination conditions. We upgraded this toolbox to enable\nit to model any type of QPM, and to take into account shot noise. In a\nnutshell, the results show that DHM and PSI are inherently free from artefacts\nand rather suffer from coherent noise; In CGM, DPC, DPM and TIE, there is a\ntrade off between precision and trueness, which can be balanced by varying one\nexperimental parameter; FPM and SLIM suffer from inherent artefacts that cannot\nbe discarded experimentally in most cases, making the techniques not\nquantitative especially for large objects covering a large part of the field of\nview, such as eukaryotic cells."}
{"arxiv_id": "2403.11912v1", "published": "2024-03-18T16:12:32Z", "title": "A $C^\\ast$-algebraic view on the interaction of real- and reciprocal\n  space topology in skyrmion crystals", "summary": "Understanding the interaction of real- and reciprocal space topology in\nskyrmion crystals is an open problem. We approach it from the viewpoint of\n$C^\\ast$-algebras and calculate all admissible Chern numbers of a strongly\ncoupled tight-binding skyrmion system on a triangular lattice as a function of\nFermi energy and texture parameters. Our analysis reveals the topological\ncomplexity of electronic states coupled to spin textures, and the failure of\nthe adiabatic picture to account for it in terms of emergent electromagnetism.\nOn the contrary, we explain the discontinuous jumps in the real-space winding\nnumber in terms of collective evolution in real-, reciprocal, and mixed space\nChern numbers. Our work sets the stage for further research on topological\ndynamics in complex dynamic spin textures coupled to external fields."}
{"arxiv_id": "2403.11839v1", "published": "2024-03-18T14:49:14Z", "title": "Terahertz Metamaterial Renormalization of Superconducting Josephson\n  Plasmons in La$_{1.85}$Sr$_{0.15}$CuO$_4$", "summary": "We investigate light-matter coupling in the cuprate superconductor\nLa$_{1.85}$Sr$_{0.15}$Cu0$_4$ (LSCO), accomplished by adhering metamaterial\nresonator arrays (MRAs) to a c-axis oriented single crystal. The resonators\ncouple to the Josephson Plasma Mode (JPM) which manifests as a plasma edge in\nthe terahertz reflectivity in the superconducting state. Terahertz reflectivity\nmeasurements at 10K reveal a renormalization of the JPM frequency,\n$\\omega_{jpm}$, from 1.7 THz for the bare crystal to $\\sim$1 THz with the MRAs.\nWith increasing temperature, the modified $\\omega_{jpm}$ redshifts as expected\nfor decreasing superfluid density, vanishing above T$_{c}$. The modification of\nthe electrodynamic response arises from resonator induced screening of the\nlongitudinal polariton response, reminiscent of plasmon-phonon coupling in\ndoped semiconductors. Modeling reveals that the electrodynamic response is\nfully interpretable using classical electromagnetism. Future studies will have\nto contend with the large effects we observe which could obscure subtle changes\nthat may indicate cavity-based manipulation of superconductivity. Finally, we\nnote that our MRA/LSCO structure is a tunable epsilon-near-zero (ENZ)\nmetamaterial that exhibits a nonlinear response arising from the c-axis\nJosephson tunneling coupled with the local fields of the resonators."}
{"arxiv_id": "2403.12746v1", "published": "2024-03-18T12:21:37Z", "title": "Super-resolution of ultrafast pulses via spectral inversion", "summary": "The resolution limits of classical spectroscopy can be surpassed by\nquantum-inspired methods leveraging the information contained in the phase of\nthe complex electromagnetic field. Their counterpart in spatial imaging has\nbeen widely discussed and demonstrated; however, the spectral-domain\nimplementations are few and scarce. We experimentally demonstrate a\nspectroscopic super-resolution method aimed at broadband light (10s to 100s of\nGHz), and based on the spectral-domain analog of image inversion\ninterferometry. In a proof-of-principle experiment, we study the paradigmatic\nproblem of estimating a small separation between two incoherent spectral\nfeatures of equal brightness, with a small number of photons per coherence\ntime. On the grounds of asymptotic estimation theory, more than a $2$-fold\nimprovement over the spectral direct imaging is demonstrated in terms of\nrequired resources (photons) for a given estimator variance. The setup is based\non an actively stabilized Mach-Zehnder-type interferometer with electro-optic\ntime lenses and passive spectral dispersers implementing the inversion. As\nsuch, the method promises on-chip integration, good scalability, and further\napplications e.g. for mode sorting."}
{"arxiv_id": "2403.11181v1", "published": "2024-03-17T11:55:35Z", "title": "Solving Maxwell's Equations", "summary": "This paper discusses the use of the Riemann-Silberstein vector to solve the\nsource-free Maxwell's equations and obtains novel analytical solutions. The\nsolving process naturally leads to the spinor form of the source-free Maxwell's\nequations. Several powerful theorems are established to solve this spinor form\nequation. The Waveguide Solution Theorem provides an elegant way to solve\nwaveguide problems, while The Schrodinger Solution Theorem connects the\nMaxwell's equations with the two-dimensional Schrodinger equation. By utilizing\nThe Schrodinger Solution Theorem, a precise formula for spatiotemporal\ndiffraction of the Maxwell's equations is derived, which allows for the\nreconstruction of electromagnetic waves throughout space and time based on the\nfield distribution on the diffraction screen."}
